PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_eth_v3.h
/***************************************************************************//**
* \file cyip_eth_v3.h
*
* \brief
* ETH IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_ETH_V3_H_
#define _CYIP_ETH_V3_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                     ETH
*******************************************************************************/

#define ETH_SECTION_SIZE                        0x00010000UL

/**
  * \brief Ethernet Interface (ETH)
  */
typedef struct
{
    __IOM uint32_t CTL;                           /*!< 0x00000000 EMAC Control Register */
    __IM uint32_t STATUS;                        /*!< 0x00000004 EMAC Status Register */
    __IM uint32_t RESERVED[1022];
    __IOM uint32_t NETWORK_CONTROL;               /*!< 0x00001000 The network control register contains general MAC control
                                                                functions for both receiver and transmitter. */
    __IOM uint32_t NETWORK_CONFIG;                /*!< 0x00001004 The network configuration register contains functions for
                                                                setting the mode of operation for the Gigabit Ethernet MAC. */
    __IM uint32_t NETWORK_STATUS;                /*!< 0x00001008 The network status register returns status information with
                                                                respect to the PHY management interface. */
    __IM uint32_t USER_IO_REGISTER;              /*!< 0x0000100C Not presents. Access to the register will return AHB error. */
    __IOM uint32_t DMA_CONFIG;                    /*!< 0x00001010 DMA Configuration Register */
    __IOM uint32_t TRANSMIT_STATUS;               /*!< 0x00001014 This register, when read, provides details of the status of a
                                                                transmit. Once read, individual bits may be cleared by writing 1
                                                                to them. It is not possible to set a bit to 1 by writing to the
                                                                register. */
    __IOM uint32_t RECEIVE_Q_PTR;                 /*!< 0x00001018 This register holds the start address of the receive buffer
                                                                queue (receive buffers descriptor list). The receive buffer
                                                                queue base address must be initialized before receive is enabled
                                                                through bit 2 of the network control register. Once reception is
                                                                enabled, any write to the receive buffer queue base address
                                                                register is ignored. Reading this register returns the location
                                                                of the descriptor currently being accessed. This value
                                                                increments as buffers are used. Software should not use this
                                                                register for determining where to remove received frames from
                                                                the queue as it constantly changes as new frames are received.
                                                                Software should instead work its way through the buffer
                                                                descriptor queue checking the used bits. In terms of AMBA (AXI)
                                                                operation, the receive descriptors are read from memory using a
                                                                single 32bit AXI access. When the datapath is configured at
                                                                64bit, the receive descriptors should be aligned at 64-bit
                                                                boundaries and each pair of 32-bit descriptors is written to
                                                                using a single 64bit AXI access. */
    __IOM uint32_t TRANSMIT_Q_PTR;                /*!< 0x0000101C This register holds the start address of the transmit buffer
                                                                queue (transmit buffers descriptor list). The transmit buffer
                                                                queue base address register must be initialized before transmit
                                                                is started through bit 9 of the network control register. Once
                                                                transmission has started, any write to the transmit buffer queue
                                                                base address register is illegal and therefore ignored. Note
                                                                that due to clock boundary synchronization, it takes a maximum
                                                                of four pclk cycles from the writing of the transmit start bit
                                                                before the transmitter is active. Writing to the transmit buffer
                                                                queue base address register during this time may produce
                                                                unpredictable results. Reading this register returns the
                                                                location of the descriptor currently being accessed. Because the
                                                                DMA can store data for multiple frames at once, this may not
                                                                necessarily be pointing to the current frame being transmitted.
                                                                In terms of AMBA AXI operation, the transmit descriptors are
                                                                written to memory using a single 32bit AHB access. When the
                                                                datapath is configured as 64bit, the transmit descriptors should
                                                                be aligned at 64-bit boundaries and each pair of 32-bit
                                                                descriptors is read from memory using a single AXI access. */
    __IOM uint32_t RECEIVE_STATUS;                /*!< 0x00001020 This register, when read provides details of the status of a
                                                                receive. Once read, individual bits may be cleared by writing 1
                                                                to them. It is not possible to set a bit to 1 by writing to the
                                                                register. */
    __IOM uint32_t INT_STATUS;                    /*!< 0x00001024 If not configured for priority queueing, the GEM generates a
                                                                single interrupt. This register indicates the source of this
                                                                interrupt. The corresponding bit in the mask register must be
                                                                clear for a bit to be set. If any bit is set in this register
                                                                the ethernet_int signal will be asserted. For test purposes each
                                                                bit can be set or reset by writing to the interrupt mask
                                                                register. The default configuration is shown below whereby all
                                                                bits are reset to zero on read. Changing the validity of the
                                                                `gem_irq_read_clear define will instead require a one to be
                                                                written to the appropriate bit in order to clear it. In this
                                                                mode reading has no affect on the status of the bit. */
    __OM uint32_t INT_ENABLE;                    /*!< 0x00001028 At reset all interrupts are disabled. Writing a one to the
                                                                relevant bit location enables the required interrupt. This
                                                                register is write only and when read will return zero. */
    __IOM uint32_t INT_DISABLE;                   /*!< 0x0000102C Writing a 1 to the relevant bit location disables that
                                                                particular interrupt. This register is write only and when read
                                                                will return zero. */
    __IM uint32_t INT_MASK;                      /*!< 0x00001030 The interrupt mask register is a read only register indicating
                                                                which interrupts are masked. All bits are set at reset and can
                                                                be reset individually by writing to the interrupt enable
                                                                register or set individually by writing to the interrupt disable
                                                                register. Having separate address locations for enable and
                                                                disable saves the need for performing a read modify write when
                                                                updating the interrupt mask register. For test purposes there is
                                                                a write-only function to this register that allows the bits in
                                                                the interrupt status register to be set or cleared, regardless
                                                                of the state of the mask register. */
    __IOM uint32_t PHY_MANAGEMENT;                /*!< 0x00001034 The PHY maintenance register is implemented as a shift
                                                                register. Writing to the register starts a shift operation which
                                                                is signalled as complete when bit-2 is set in the network status
                                                                register. It takes about 2000 pclk cycles to complete, when MDC
                                                                is set for pclk divide by 32 in the network configuration
                                                                register. An interrupt is generated upon completion. During this
                                                                time, the MSB of the register is output on the MDIO pin and the
                                                                LSB updated from the MDIO pin with each MDC cycle. This causes
                                                                transmission of a PHY management frame on MDIO. See Section
                                                                22.2.4.5 of the IEEE 802.3 standard. Reading during the shift
                                                                operation will return the current contents of the shift
                                                                register. At the end of management operation, the bits will have
                                                                shifted back to their original locations. For a read operation,
                                                                the data bits will be updated with data read from the PHY. It is
                                                                important to write the correct values to the register to ensure
                                                                a valid PHY management frame is produced. The MDIO interface can
                                                                read IEEE 802.3 clause 45 PHYs as well as clause 22 PHYs. To
                                                                read clause 45 PHYs, bit 30 should be written with a 0 rather
                                                                than a 1. For a description of MDC generation, see Network
                                                                Configuration Register. */
    __IM uint32_t PAUSE_TIME;                    /*!< 0x00001038 Received Pause Quantum Register */
    __IOM uint32_t TX_PAUSE_QUANTUM;              /*!< 0x0000103C Transmit Pause Quantum Register */
    __IOM uint32_t PBUF_TXCUTTHRU;                /*!< 0x00001040 Partial store and forward is only applicable when using the DMA
                                                                configured in SRAM based packet buffer mode. It is also not
                                                                available when using multi buffer frames. TX Partial Store and
                                                                Forward */
    __IOM uint32_t PBUF_RXCUTTHRU;                /*!< 0x00001044 RX Partial Store and Forward */
    __IOM uint32_t JUMBO_MAX_LENGTH;              /*!< 0x00001048 Maximum Jumbo Frame Size. */
    __IM uint32_t EXTERNAL_FIFO_INTERFACE;       /*!< 0x0000104C Not presents. */
    __IM uint32_t RESERVED1;
    __IOM uint32_t AXI_MAX_PIPELINE;              /*!< 0x00001054 Used to set the maximum amount of outstanding transactions on
                                                                the AXI bus between AR / R channels and AW / W channels. Cannot
                                                                be more than the depth of the configured AXI pipeline FIFO
                                                                (defined in verilog defs.v) */
    __IM uint32_t RSC_CONTROL;                   /*!< 0x00001058 Not presents. Access to the register will return AHB error. */
    __IOM uint32_t INT_MODERATION;                /*!< 0x0000105C Used to moderate the number of transmit and receive complete
                                                                interrupts issued. With interrupt moderation enabled receive and
                                                                transmit interrupts are not generated immediately a frame is
                                                                transmitted or received. Instead when a receive or transmit
                                                                event occurs a timer is started and the interrupt is asserted
                                                                after it times out. This limits the frequency with which the CPU
                                                                receives interrupts. When interrupt moderation is enabled
                                                                interrupt status bit one is always used for receive and bit 7 is
                                                                always used for transmit even when priority queuing is enabled.
                                                                With interrupt moderation 800ns periods are counted. GEM
                                                                determines what constitutes an 800ns period by looking at the
                                                                tbi (bit 11), gigabit bit (10) and speed (bit 0) bits in the
                                                                network configuration register and counting tx_clk cycles. Bit 0
                                                                needs to be set to 1 for 100M operation. */
    __IOM uint32_t SYS_WAKE_TIME;                 /*!< 0x00001060 Used to pause transmission after deassertion of tx_lpi_en. Each
                                                                unit in this register corresponds to 64ns in gigabit mode, 320ns
                                                                in 100M mode and 3200ns at 10M. After tx_lpi_en is deasserted
                                                                transmission will pause for the set time. */
    __IM uint32_t RESERVED2[7];
    __IOM uint32_t HASH_BOTTOM;                   /*!< 0x00001080 The unicast hash enable and the multicast hash enable bits in
                                                                the network configuration register enable the reception of hash
                                                                matched frames. Hash Register Bottom (31 to 0 bits) */
    __IOM uint32_t HASH_TOP;                      /*!< 0x00001084 Hash Register Top (63 to 32 bits) */
    __IOM uint32_t SPEC_ADD1_BOTTOM;              /*!< 0x00001088 The addresses stored in the specific address registers are
                                                                deactivated at reset or when their corresponding specific
                                                                address register bottom is written. They are activated when
                                                                specific address register top is written. */
    __IOM uint32_t SPEC_ADD1_TOP;                 /*!< 0x0000108C Specific Address Top */
    __IOM uint32_t SPEC_ADD2_BOTTOM;              /*!< 0x00001090 The addresses stored in the specific address registers are
                                                                deactivated at reset or when their corresponding specific
                                                                address register bottom is written. They are activated when
                                                                specific address register top is written. */
    __IOM uint32_t SPEC_ADD2_TOP;                 /*!< 0x00001094 Specific Address Top */
    __IOM uint32_t SPEC_ADD3_BOTTOM;              /*!< 0x00001098 The addresses stored in the specific address registers are
                                                                deactivated at reset or when their corresponding specific
                                                                address register bottom is written. They are activated when
                                                                specific address register top is written. */
    __IOM uint32_t SPEC_ADD3_TOP;                 /*!< 0x0000109C Specific Address Top */
    __IOM uint32_t SPEC_ADD4_BOTTOM;              /*!< 0x000010A0 The addresses stored in the specific address registers are
                                                                deactivated at reset or when their corresponding specific
                                                                address register bottom is written. They are activated when
                                                                specific address register top is written. */
    __IOM uint32_t SPEC_ADD4_TOP;                 /*!< 0x000010A4 Specific Address Top */
    __IOM uint32_t SPEC_TYPE1;                    /*!< 0x000010A8 Type ID Match 1 */
    __IOM uint32_t SPEC_TYPE2;                    /*!< 0x000010AC Type ID Match 2 */
    __IOM uint32_t SPEC_TYPE3;                    /*!< 0x000010B0 Type ID Match 3 */
    __IOM uint32_t SPEC_TYPE4;                    /*!< 0x000010B4 Type ID Match 4 */
    __IOM uint32_t WOL_REGISTER;                  /*!< 0x000010B8 Wake on LAN Register. Presents in design, but feature is not
                                                                supported. */
    __IOM uint32_t STRETCH_RATIO;                 /*!< 0x000010BC IPG stretch register */
    __IOM uint32_t STACKED_VLAN;                  /*!< 0x000010C0 Stacked VLAN Register */
    __IOM uint32_t TX_PFC_PAUSE;                  /*!< 0x000010C4 Transmit PFC Pause Register */
    __IOM uint32_t MASK_ADD1_BOTTOM;              /*!< 0x000010C8 Specific Address Mask 1 Bottom (31 to 0 bits) */
    __IOM uint32_t MASK_ADD1_TOP;                 /*!< 0x000010CC Specific Address Mask 1 Top (47 to 32 bits) */
    __IOM uint32_t DMA_ADDR_OR_MASK;              /*!< 0x000010D0 Receive DMA Data Buffer Address Mask */
    __IOM uint32_t RX_PTP_UNICAST;                /*!< 0x000010D4 PTP RX unicast IP destination address */
    __IOM uint32_t TX_PTP_UNICAST;                /*!< 0x000010D8 PTP TX unicast IP destination address */
    __IOM uint32_t TSU_NSEC_CMP;                  /*!< 0x000010DC TSU timer comparison value nanoseconds */
    __IOM uint32_t TSU_SEC_CMP;                   /*!< 0x000010E0 TSU timer comparison value seconds (31 to 0 bits) */
    __IOM uint32_t TSU_MSB_SEC_CMP;               /*!< 0x000010E4 TSU timer comparison value seconds (47 to 32 bits) */
    __IM uint32_t TSU_PTP_TX_MSB_SEC;            /*!< 0x000010E8 PTP Event Frame Transmitted Seconds Register (47 to 32 bits) */
    __IM uint32_t TSU_PTP_RX_MSB_SEC;            /*!< 0x000010EC PTP Event Frame Received Seconds Register (47 to 32 bits) */
    __IM uint32_t TSU_PEER_TX_MSB_SEC;           /*!< 0x000010F0 PTP Peer Event Frame Transmitted Seconds Register (47 to 32
                                                                bits) */
    __IM uint32_t TSU_PEER_RX_MSB_SEC;           /*!< 0x000010F4 PTP Peer Event Frame Received Seconds Register (47 to 32 bits) */
    __IOM uint32_t DPRAM_FILL_DBG;                /*!< 0x000010F8 The fill levels for the TX & RX packet buffers can be read
                                                                using this register, including the fill level for each queue in
                                                                the TX direction. */
    __IM uint32_t REVISION_REG;                  /*!< 0x000010FC This register indicates a Cadence module identification number
                                                                and module revision. The value of this register is read only as
                                                                defined by `gem_revision_reg_value */
    __IM uint32_t OCTETS_TXED_BOTTOM;            /*!< 0x00001100 Octets Transmitted lower bits (31 to 0 bits) */
    __IM uint32_t OCTETS_TXED_TOP;               /*!< 0x00001104 Octets Transmitted higher bits (47 to 32 bits) */
    __IM uint32_t FRAMES_TXED_OK;                /*!< 0x00001108 Frames Transmitted */
    __IM uint32_t BROADCAST_TXED;                /*!< 0x0000110C Broadcast Frames Transmitted */
    __IM uint32_t MULTICAST_TXED;                /*!< 0x00001110 Multicast Frames Transmitted */
