PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_eth_v3.h
                                                                expected rate, and in this case very accurate transmission rates
                                                                can be achieved. */
    __IOM uint32_t CBS_IDLESLOPE_Q_A;             /*!< 0x000014C0 queue A is the highest priority queue. This would be queue 8 in
                                                                an 8 queue configuration. */
    __IOM uint32_t CBS_IDLESLOPE_Q_B;             /*!< 0x000014C4 queue B is the 2nd highest priority queue. This would be queue
                                                                7 in an 8 queue configuration. */
    __IOM uint32_t UPPER_TX_Q_BASE_ADDR;          /*!< 0x000014C8 Upper 32 bits of transmit buffer descriptor queue base address. */
    __IOM uint32_t TX_BD_CONTROL;                 /*!< 0x000014CC TX BD control register */
    __IOM uint32_t RX_BD_CONTROL;                 /*!< 0x000014D0 RX BD control register */
    __IOM uint32_t UPPER_RX_Q_BASE_ADDR;          /*!< 0x000014D4 Upper 32 bits of receive buffer descriptor queue base address. */
    __IM uint32_t RESERVED17[2];
    __IOM uint32_t HIDDEN_REG0;                   /*!< 0x000014E0 Hidden register */
    __IOM uint32_t HIDDEN_REG1;                   /*!< 0x000014E4 Hidden register */
    __IOM uint32_t HIDDEN_REG2;                   /*!< 0x000014E8 Hidden register */
    __IOM uint32_t HIDDEN_REG3;                   /*!< 0x000014EC Hidden register */
    __IM uint32_t RESERVED18[2];
    __IOM uint32_t HIDDEN_REG4;                   /*!< 0x000014F8 Hidden register */
    __IOM uint32_t HIDDEN_REG5;                   /*!< 0x000014FC Hidden register */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_0;   /*!< 0x00001500 Screening type 1 registers are used to allocate up to 16
                                                                priority queues to received frames based on certain IP or UDP
                                                                fields of incoming frames. Firstly, when DS/TC match enable is
                                                                set (bit 28), the DS (Differentiated Services) field of the
                                                                received IPv4 header or TCfield (traffic class) of IPv6 headers
                                                                are matched against bits 11 to 4. Secondly, when UDP port match
                                                                enable is set (bit 29), the UDP Destination Port of the received
                                                                UDP frame is matched against bits 27 to 12. Both UDP and DS/TC
                                                                matching can be enabled simultaneously or individually. If a
                                                                match is successful, then the queue value programmed in bits 2
                                                                to 0 is allocated to the frame. The required number of Type 1
                                                                screening registers is configured in the gem defines file. Up to
                                                                16 type 1 screening registers have been allocated APB address
                                                                space between 0x500 and 0x53C. */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_1;   /*!< 0x00001504 screening type 1 register 1, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_2;   /*!< 0x00001508 screening type 1 register 2, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_3;   /*!< 0x0000150C screening type 1 register 3, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_4;   /*!< 0x00001510 screening type 1 register 4, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_5;   /*!< 0x00001514 screening type 1 register 5, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_6;   /*!< 0x00001518 screening type 1 register 6, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_7;   /*!< 0x0000151C screening type 1 register 7, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_8;   /*!< 0x00001520 screening type 1 register 8, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_9;   /*!< 0x00001524 screening type 1 register 9, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_10;  /*!< 0x00001528 screening type 1 register 10, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_11;  /*!< 0x0000152C screening type 1 register 11, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_12;  /*!< 0x00001530 screening type 1 register 12, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_13;  /*!< 0x00001534 screening type 1 register 13, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_14;  /*!< 0x00001538 screening type 1 register 14, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_1_REGISTER_15;  /*!< 0x0000153C screening type 1 register 15, same as
                                                                screening_type_1_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_0;   /*!< 0x00001540 Screener Type 2 match registers operate independently of
                                                                screener type 1 registers and offer additional match
                                                                capabilities, extending the capabilities into vendor specific
                                                                protocols. */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_1;   /*!< 0x00001544 screening type 2 register 1, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_2;   /*!< 0x00001548 screening type 2 register 2, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_3;   /*!< 0x0000154C screening type 2 register 3, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_4;   /*!< 0x00001550 screening type 2 register 4, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_5;   /*!< 0x00001554 screening type 2 register 5, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_6;   /*!< 0x00001558 screening type 2 register 6, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_7;   /*!< 0x0000155C screening type 2 register 7, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_8;   /*!< 0x00001560 screening type 2 register 8, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_9;   /*!< 0x00001564 screening type 2 register 9, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_10;  /*!< 0x00001568 screening type 2 register 10, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_11;  /*!< 0x0000156C screening type 2 register 11, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_12;  /*!< 0x00001570 screening type 2 register 12, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_13;  /*!< 0x00001574 screening type 2 register 13, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_14;  /*!< 0x00001578 screening type 2 register 14, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t SCREENING_TYPE_2_REGISTER_15;  /*!< 0x0000157C screening type 2 register 15, same as
                                                                screening_type_2_register_0 */
    __IOM uint32_t TX_SCHED_CTRL;                 /*!< 0x00001580 This register controls the transmit scheduling algorithm the
                                                                user can select for each active transmit queue. By default all
                                                                queues are initialized to fixed priority, with the top indexed
                                                                queue having overall priority */
    __IM uint32_t RESERVED19[3];
    __IOM uint32_t BW_RATE_LIMIT_Q0TO3;           /*!< 0x00001590 This register holds the DWRR weighting value or the ETS
                                                                bandwidth percentage value used by the transmit scheduler for
                                                                queues 0 to 3. */
    __IOM uint32_t BW_RATE_LIMIT_Q4TO7;           /*!< 0x00001594 Not presents. EMAC has only 3 queues. Access to the register
                                                                returns AHB error. */
    __IM uint32_t BW_RATE_LIMIT_Q8TO11;          /*!< 0x00001598 Not presents. EMAC has only 3 queues. Access to the register
                                                                returns AHB error. */
    __IM uint32_t BW_RATE_LIMIT_Q12TO15;         /*!< 0x0000159C Not presents. EMAC has only 3 queues. Access to the register
                                                                returns AHB error. */
    __IOM uint32_t TX_Q_SEG_ALLOC_Q0TO7;          /*!< 0x000015A0 This register allows the user to distribute the Transmit SRAM
                                                                used by the DMA across the priority queues, for queues 0 to 7.
                                                                The SRAM itself is split into a number of evenly sized segments
                                                                (this is defined in the verilog configuration defs file - for
                                                                the configuration used to generate this register description,
                                                                the total number of segments was set to '16'). Those segments
                                                                can then be freely distributed across the active queues, in
                                                                powers of 2. I.e. a value of 0 would mean 1 segment has been
                                                                allocated to the queue. A value of 1 would mean 2 segments, a
                                                                value of 2 means 4 segments and so on. The reset values of these
                                                                registers are defined in the configuration defs file. */
    __IM uint32_t TX_Q_SEG_ALLOC_Q8TO15;         /*!< 0x000015A4 Not presents.  Access to the register returns AHB error. */
    __IM uint32_t RESERVED20[6];
    __IM uint32_t RECEIVE_Q8_PTR;                /*!< 0x000015C0 receive_q8_ptr to receive_q15_ptr doesn't present. Access to
                                                                the register returns AHB error. */
    __IM uint32_t RESERVED21[6];
    __IM uint32_t RECEIVE_Q15_PTR;               /*!< 0x000015DC Not presents. */
    __IM uint32_t DMA_RXBUF_SIZE_Q8;             /*!< 0x000015E0 dma_rxbuf_size_q8 to dma_rxbuf_size_q15 doesn't present. Access
                                                                to the register returns AHB error. */
    __IM uint32_t RESERVED22[6];
    __IM uint32_t DMA_RXBUF_SIZE_Q15;            /*!< 0x000015FC Not presents. */
    __OM uint32_t INT_Q1_ENABLE;                 /*!< 0x00001600 At reset all interrupts are disabled. Writing a one to the
                                                                relevant bit location enables the required interrupt. This
                                                                register is write only and when read will return zero. */
    __OM uint32_t INT_Q2_ENABLE;                 /*!< 0x00001604 At reset all interrupts are disabled. Writing a one to the
                                                                relevant bit location enables the required interrupt. This
                                                                register is write only and when read will return zero. */
    __IM uint32_t INT_Q3_ENABLE;                 /*!< 0x00001608 int_q3_enable to int_q7_enable doesn't present. Access to the
                                                                register returns AHB error. */
    __IM uint32_t RESERVED23[3];
    __IM uint32_t INT_Q7_ENABLE;                 /*!< 0x00001618 Not presents. */
    __IM uint32_t RESERVED24;
    __OM uint32_t INT_Q1_DISABLE;                /*!< 0x00001620 Writing a 1 to the relevant bit location disables that
                                                                particular interrupt. This register is write only and when read
                                                                will return zero. */
    __OM uint32_t INT_Q2_DISABLE;                /*!< 0x00001624 Writing a 1 to the relevant bit location disables that
                                                                particular interrupt. This register is write only and when read
                                                                will return zero. */
    __IM uint32_t INT_Q3_DISABLE;                /*!< 0x00001628 int_q3_disable to int_q7_disable doesn't present. Access to the
                                                                register returns AHB error. */
    __IM uint32_t RESERVED25[3];
    __IM uint32_t INT_Q7_DISABLE;                /*!< 0x00001638 Not presents. */
    __IM uint32_t RESERVED26;
    __IM uint32_t INT_Q1_MASK;                   /*!< 0x00001640 The interrupt mask register is a read only register indicating
                                                                which interrupts are masked. All bits are set at reset and can
                                                                be reset individually by writing to the interrupt enable
                                                                register or set individually by writing to the interrupt disable
                                                                register. Having separate address locations for enable and
                                                                disable saves the need for performing a read modify write when
                                                                updating the interrupt mask register. For test purposes there is
                                                                a write-only function to this register that allows the bits in
                                                                the interrupt status register to be set or cleared, regardless
                                                                of the state of the mask register. */
    __IM uint32_t INT_Q2_MASK;                   /*!< 0x00001644 The interrupt mask register is a read only register indicating
                                                                which interrupts are masked. All bits are set at reset and can
                                                                be reset individually by writing to the interrupt enable
                                                                register or set individually by writing to the interrupt disable
                                                                register. Having separate address locations for enable and
                                                                disable saves the need for performing a read modify write when
                                                                updating the interrupt mask register. For test purposes there is
                                                                a write-only function to this register that allows the bits in
                                                                the interrupt status register to be set or cleared, regardless
                                                                of the state of the mask register. */
    __IM uint32_t INT_Q3_MASK;                   /*!< 0x00001648 int_q3_mask to int_q7_mask doesn't present. Access to the
                                                                register returns AHB error. */
    __IM uint32_t RESERVED27[3];
    __IM uint32_t INT_Q7_MASK;                   /*!< 0x00001658 Not presents. */
    __IM uint32_t RESERVED28;
    __IM uint32_t INT_Q8_ENABLE;                 /*!< 0x00001660 int_q8_enable to int_q15_enable doesn't present. Access to the
                                                                register returns AHB error. */
    __IM uint32_t RESERVED29[6];
    __IM uint32_t INT_Q15_ENABLE;                /*!< 0x0000167C Not presents. */
    __IM uint32_t INT_Q8_DISABLE;                /*!< 0x00001680 int_q8_disable to int_q15_disable doesn't present. Access to
                                                                the register returns AHB error. */
    __IM uint32_t RESERVED30[6];
    __IM uint32_t INT_Q15_DISABLE;               /*!< 0x0000169C Not presents. */
    __IM uint32_t INT_Q8_MASK;                   /*!< 0x000016A0 int_q8_mask to int_q15_mask doesn't present. Access to the
                                                                register returns AHB error. */
    __IM uint32_t RESERVED31[6];
    __IM uint32_t INT_Q15_MASK;                  /*!< 0x000016BC Not presents. */
    __IM uint32_t RESERVED32[8];
    __IOM uint32_t SCREENING_TYPE_2_ETHERTYPE_REG_0; /*!< 0x000016E0 Ethertype Register */
    __IOM uint32_t SCREENING_TYPE_2_ETHERTYPE_REG_1; /*!< 0x000016E4 Ethertype Register */
    __IOM uint32_t SCREENING_TYPE_2_ETHERTYPE_REG_2; /*!< 0x000016E8 Ethertype Register */
    __IOM uint32_t SCREENING_TYPE_2_ETHERTYPE_REG_3; /*!< 0x000016EC Ethertype Register */
    __IOM uint32_t SCREENING_TYPE_2_ETHERTYPE_REG_4; /*!< 0x000016F0 Ethertype Register */
    __IOM uint32_t SCREENING_TYPE_2_ETHERTYPE_REG_5; /*!< 0x000016F4 Ethertype Register */
    __IOM uint32_t SCREENING_TYPE_2_ETHERTYPE_REG_6; /*!< 0x000016F8 Ethertype Register */
    __IOM uint32_t SCREENING_TYPE_2_ETHERTYPE_REG_7; /*!< 0x000016FC Ethertype Register */
    __IOM uint32_t TYPE2_COMPARE_0_WORD_0;        /*!< 0x00001700 'Compare A, B and C fields of the screener type 2 match
                                                                register are pointers to a pool of up to 32 compare registers.
                                                                If enabled the compare is true if the data at the OFFSET into
                                                                the frame, ANDed with the MASK Value if the mask is enabled, is
                                                                equal to the COMPARE Value. Either a 16 bit comparison or a 32
                                                                bit comparison is done. This selection is made via the
                                                                associated compare word1 register bit 9. If a 16 bit comparison
                                                                is selected, then a 16 bit mask is also available to the user to
                                                                select which bits should be compared. If the 32 bit compare
                                                                option is selected, then no mask is available. The byte at the
                                                                OFFSET number of bytes from the index start is compared thru
                                                                bits 7 to 0 of the configured VALUE. The byte at the OFFSET
                                                                number of bytes + 1 from the index start is compared thru bits
                                                                15 to 8 of the configured VALUE and so on. The OFFSET can be
                                                                configured to be from 0 to 127 bytes from either the start of
                                                                the frame, the byte following the therType field (last EtherType
                                                                in the header if the frame is VLAN tagged), the byte following
                                                                the IP header (IPv4 or IPv6) or from the byte following the
                                                                start of the TCP/UDP header. The required number of Type 2
                                                                screening registers up to a maximum of 32 is configurable in the
                                                                gem defines file and have been allocated APB address space
                                                                between 0x700 and 0x7fc. Note. when using RX Partial Store and
                                                                Forward mode and priority queues, the frame offset must be less
                                                                than the Partial Store and Forward watermark. If the offset is
                                                                higher than the watermark value it's not possible to identify
                                                                the priority queue before the frame is sent to the AMBA
                                                                interface, and an incorrect priority queue may be used. ' */
    __IOM uint32_t TYPE2_COMPARE_0_WORD_1;        /*!< 0x00001704 'Type2 Compare Word 1' */
    __IOM uint32_t TYPE2_COMPARE_1_WORD_0;        /*!< 0x00001708 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_1_WORD_1;        /*!< 0x0000170C same as type2_compare_0_word_1 */
