PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_eth_v3.h
    __IOM uint32_t TYPE2_COMPARE_2_WORD_0;        /*!< 0x00001710 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_2_WORD_1;        /*!< 0x00001714 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_3_WORD_0;        /*!< 0x00001718 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_3_WORD_1;        /*!< 0x0000171C same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_4_WORD_0;        /*!< 0x00001720 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_4_WORD_1;        /*!< 0x00001724 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_5_WORD_0;        /*!< 0x00001728 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_5_WORD_1;        /*!< 0x0000172C same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_6_WORD_0;        /*!< 0x00001730 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_6_WORD_1;        /*!< 0x00001734 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_7_WORD_0;        /*!< 0x00001738 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_7_WORD_1;        /*!< 0x0000173C same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_8_WORD_0;        /*!< 0x00001740 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_8_WORD_1;        /*!< 0x00001744 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_9_WORD_0;        /*!< 0x00001748 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_9_WORD_1;        /*!< 0x0000174C same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_10_WORD_0;       /*!< 0x00001750 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_10_WORD_1;       /*!< 0x00001754 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_11_WORD_0;       /*!< 0x00001758 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_11_WORD_1;       /*!< 0x0000175C same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_12_WORD_0;       /*!< 0x00001760 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_12_WORD_1;       /*!< 0x00001764 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_13_WORD_0;       /*!< 0x00001768 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_13_WORD_1;       /*!< 0x0000176C same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_14_WORD_0;       /*!< 0x00001770 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_14_WORD_1;       /*!< 0x00001774 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_15_WORD_0;       /*!< 0x00001778 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_15_WORD_1;       /*!< 0x0000177C same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_16_WORD_0;       /*!< 0x00001780 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_16_WORD_1;       /*!< 0x00001784 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_17_WORD_0;       /*!< 0x00001788 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_17_WORD_1;       /*!< 0x0000178C same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_18_WORD_0;       /*!< 0x00001790 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_18_WORD_1;       /*!< 0x00001794 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_19_WORD_0;       /*!< 0x00001798 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_19_WORD_1;       /*!< 0x0000179C same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_20_WORD_0;       /*!< 0x000017A0 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_20_WORD_1;       /*!< 0x000017A4 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_21_WORD_0;       /*!< 0x000017A8 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_21_WORD_1;       /*!< 0x000017AC same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_22_WORD_0;       /*!< 0x000017B0 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_22_WORD_1;       /*!< 0x000017B4 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_23_WORD_0;       /*!< 0x000017B8 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_23_WORD_1;       /*!< 0x000017BC same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_24_WORD_0;       /*!< 0x000017C0 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_24_WORD_1;       /*!< 0x000017C4 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_25_WORD_0;       /*!< 0x000017C8 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_25_WORD_1;       /*!< 0x000017CC same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_26_WORD_0;       /*!< 0x000017D0 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_26_WORD_1;       /*!< 0x000017D4 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_27_WORD_0;       /*!< 0x000017D8 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_27_WORD_1;       /*!< 0x000017DC same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_28_WORD_0;       /*!< 0x000017E0 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_28_WORD_1;       /*!< 0x000017E4 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_29_WORD_0;       /*!< 0x000017E8 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_29_WORD_1;       /*!< 0x000017EC same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_30_WORD_0;       /*!< 0x000017F0 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_30_WORD_1;       /*!< 0x000017F4 same as type2_compare_0_word_1 */
    __IOM uint32_t TYPE2_COMPARE_31_WORD_0;       /*!< 0x000017F8 same as type2_compare_0_word_0 */
    __IOM uint32_t TYPE2_COMPARE_31_WORD_1;       /*!< 0x000017FC same as type2_compare_0_word_1 */
} ETH_Type;                                     /*!< Size = 6144 (0x1800) */


