PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_eth_v3.h
/* ETH.CTL */
#define ETH_CTL_ETH_MODE_Pos                    0UL
#define ETH_CTL_ETH_MODE_Msk                    0x3UL
#define ETH_CTL_REFCLK_SRC_SEL_Pos              2UL
#define ETH_CTL_REFCLK_SRC_SEL_Msk              0x4UL
#define ETH_CTL_REFCLK_DIV_Pos                  8UL
#define ETH_CTL_REFCLK_DIV_Msk                  0xFF00UL
#define ETH_CTL_ENABLED_Pos                     31UL
#define ETH_CTL_ENABLED_Msk                     0x80000000UL
/* ETH.STATUS */
#define ETH_STATUS_PFC_NEGOTIATE_Pos            0UL
#define ETH_STATUS_PFC_NEGOTIATE_Msk            0x1UL
#define ETH_STATUS_RX_PFC_PAUSED_Pos            8UL
#define ETH_STATUS_RX_PFC_PAUSED_Msk            0xFF00UL
/* ETH.NETWORK_CONTROL */
#define ETH_NETWORK_CONTROL_LOOPBACK_Pos        0UL
#define ETH_NETWORK_CONTROL_LOOPBACK_Msk        0x1UL
#define ETH_NETWORK_CONTROL_LOOPBACK_LOCAL_Pos  1UL
#define ETH_NETWORK_CONTROL_LOOPBACK_LOCAL_Msk  0x2UL
#define ETH_NETWORK_CONTROL_ENABLE_RECEIVE_Pos  2UL
#define ETH_NETWORK_CONTROL_ENABLE_RECEIVE_Msk  0x4UL
#define ETH_NETWORK_CONTROL_ENABLE_TRANSMIT_Pos 3UL
#define ETH_NETWORK_CONTROL_ENABLE_TRANSMIT_Msk 0x8UL
#define ETH_NETWORK_CONTROL_MAN_PORT_EN_Pos     4UL
#define ETH_NETWORK_CONTROL_MAN_PORT_EN_Msk     0x10UL
#define ETH_NETWORK_CONTROL_CLEAR_ALL_STATS_REGS_Pos 5UL
#define ETH_NETWORK_CONTROL_CLEAR_ALL_STATS_REGS_Msk 0x20UL
#define ETH_NETWORK_CONTROL_INC_ALL_STATS_REGS_Pos 6UL
#define ETH_NETWORK_CONTROL_INC_ALL_STATS_REGS_Msk 0x40UL
#define ETH_NETWORK_CONTROL_STATS_WRITE_EN_Pos  7UL
#define ETH_NETWORK_CONTROL_STATS_WRITE_EN_Msk  0x80UL
#define ETH_NETWORK_CONTROL_BACK_PRESSURE_Pos   8UL
#define ETH_NETWORK_CONTROL_BACK_PRESSURE_Msk   0x100UL
#define ETH_NETWORK_CONTROL_TX_START_PCLK_Pos   9UL
#define ETH_NETWORK_CONTROL_TX_START_PCLK_Msk   0x200UL
#define ETH_NETWORK_CONTROL_TX_HALT_PCLK_Pos    10UL
#define ETH_NETWORK_CONTROL_TX_HALT_PCLK_Msk    0x400UL
#define ETH_NETWORK_CONTROL_TX_PAUSE_FRAME_REQ_Pos 11UL
#define ETH_NETWORK_CONTROL_TX_PAUSE_FRAME_REQ_Msk 0x800UL
#define ETH_NETWORK_CONTROL_TX_PAUSE_FRAME_ZERO_Pos 12UL
#define ETH_NETWORK_CONTROL_TX_PAUSE_FRAME_ZERO_Msk 0x1000UL
#define ETH_NETWORK_CONTROL_REMOVED_13_Pos      13UL
#define ETH_NETWORK_CONTROL_REMOVED_13_Msk      0x2000UL
#define ETH_NETWORK_CONTROL_REMOVED_14_Pos      14UL
#define ETH_NETWORK_CONTROL_REMOVED_14_Msk      0x4000UL
#define ETH_NETWORK_CONTROL_STORE_RX_TS_Pos     15UL
#define ETH_NETWORK_CONTROL_STORE_RX_TS_Msk     0x8000UL
#define ETH_NETWORK_CONTROL_PFC_ENABLE_Pos      16UL
#define ETH_NETWORK_CONTROL_PFC_ENABLE_Msk      0x10000UL
#define ETH_NETWORK_CONTROL_TRANSMIT_PFC_PRIORITY_BASED_PAUSE_FRAME_Pos 17UL
#define ETH_NETWORK_CONTROL_TRANSMIT_PFC_PRIORITY_BASED_PAUSE_FRAME_Msk 0x20000UL
#define ETH_NETWORK_CONTROL_FLUSH_RX_PKT_PCLK_Pos 18UL
#define ETH_NETWORK_CONTROL_FLUSH_RX_PKT_PCLK_Msk 0x40000UL
#define ETH_NETWORK_CONTROL_TX_LPI_EN_Pos       19UL
#define ETH_NETWORK_CONTROL_TX_LPI_EN_Msk       0x80000UL
#define ETH_NETWORK_CONTROL_PTP_UNICAST_ENA_Pos 20UL
#define ETH_NETWORK_CONTROL_PTP_UNICAST_ENA_Msk 0x100000UL
#define ETH_NETWORK_CONTROL_ALT_SGMII_MODE_Pos  21UL
#define ETH_NETWORK_CONTROL_ALT_SGMII_MODE_Msk  0x200000UL
#define ETH_NETWORK_CONTROL_STORE_UDP_OFFSET_Pos 22UL
#define ETH_NETWORK_CONTROL_STORE_UDP_OFFSET_Msk 0x400000UL
#define ETH_NETWORK_CONTROL_EXT_TSU_PORT_ENABLE_Pos 23UL
#define ETH_NETWORK_CONTROL_EXT_TSU_PORT_ENABLE_Msk 0x800000UL
#define ETH_NETWORK_CONTROL_ONE_STEP_SYNC_MODE_Pos 24UL
#define ETH_NETWORK_CONTROL_ONE_STEP_SYNC_MODE_Msk 0x1000000UL
#define ETH_NETWORK_CONTROL_PFC_CTRL_Pos        25UL
#define ETH_NETWORK_CONTROL_PFC_CTRL_Msk        0x2000000UL
#define ETH_NETWORK_CONTROL_EXT_RXQ_SEL_EN_Pos  26UL
#define ETH_NETWORK_CONTROL_EXT_RXQ_SEL_EN_Msk  0x4000000UL
#define ETH_NETWORK_CONTROL_OSS_CORRECTION_FIELD_Pos 27UL
#define ETH_NETWORK_CONTROL_OSS_CORRECTION_FIELD_Msk 0x8000000UL
#define ETH_NETWORK_CONTROL_SEL_MII_ON_RGMII_Pos 28UL
#define ETH_NETWORK_CONTROL_SEL_MII_ON_RGMII_Msk 0x10000000UL
#define ETH_NETWORK_CONTROL_TWO_PT_FIVE_GIG_Pos 29UL
#define ETH_NETWORK_CONTROL_TWO_PT_FIVE_GIG_Msk 0x20000000UL
#define ETH_NETWORK_CONTROL_IFG_EATS_QAV_CREDIT_Pos 30UL
#define ETH_NETWORK_CONTROL_IFG_EATS_QAV_CREDIT_Msk 0x40000000UL
#define ETH_NETWORK_CONTROL_EXT_RXQ_RESERVED_31_Pos 31UL
#define ETH_NETWORK_CONTROL_EXT_RXQ_RESERVED_31_Msk 0x80000000UL
/* ETH.NETWORK_CONFIG */
#define ETH_NETWORK_CONFIG_SPEED_Pos            0UL
#define ETH_NETWORK_CONFIG_SPEED_Msk            0x1UL
#define ETH_NETWORK_CONFIG_FULL_DUPLEX_Pos      1UL
#define ETH_NETWORK_CONFIG_FULL_DUPLEX_Msk      0x2UL
#define ETH_NETWORK_CONFIG_DISCARD_NON_VLAN_FRAMES_Pos 2UL
#define ETH_NETWORK_CONFIG_DISCARD_NON_VLAN_FRAMES_Msk 0x4UL
#define ETH_NETWORK_CONFIG_JUMBO_FRAMES_Pos     3UL
#define ETH_NETWORK_CONFIG_JUMBO_FRAMES_Msk     0x8UL
#define ETH_NETWORK_CONFIG_COPY_ALL_FRAMES_Pos  4UL
#define ETH_NETWORK_CONFIG_COPY_ALL_FRAMES_Msk  0x10UL
#define ETH_NETWORK_CONFIG_NO_BROADCAST_Pos     5UL
#define ETH_NETWORK_CONFIG_NO_BROADCAST_Msk     0x20UL
#define ETH_NETWORK_CONFIG_MULTICAST_HASH_ENABLE_Pos 6UL
#define ETH_NETWORK_CONFIG_MULTICAST_HASH_ENABLE_Msk 0x40UL
#define ETH_NETWORK_CONFIG_UNICAST_HASH_ENABLE_Pos 7UL
#define ETH_NETWORK_CONFIG_UNICAST_HASH_ENABLE_Msk 0x80UL
#define ETH_NETWORK_CONFIG_RECEIVE_1536_BYTE_FRAMES_Pos 8UL
#define ETH_NETWORK_CONFIG_RECEIVE_1536_BYTE_FRAMES_Msk 0x100UL
#define ETH_NETWORK_CONFIG_EXTERNAL_ADDRESS_MATCH_ENABLE_Pos 9UL
#define ETH_NETWORK_CONFIG_EXTERNAL_ADDRESS_MATCH_ENABLE_Msk 0x200UL
#define ETH_NETWORK_CONFIG_GIGABIT_MODE_ENABLE_Pos 10UL
#define ETH_NETWORK_CONFIG_GIGABIT_MODE_ENABLE_Msk 0x400UL
#define ETH_NETWORK_CONFIG_PCS_SELECT_Pos       11UL
#define ETH_NETWORK_CONFIG_PCS_SELECT_Msk       0x800UL
#define ETH_NETWORK_CONFIG_RETRY_TEST_Pos       12UL
#define ETH_NETWORK_CONFIG_RETRY_TEST_Msk       0x1000UL
#define ETH_NETWORK_CONFIG_PAUSE_ENABLE_Pos     13UL
#define ETH_NETWORK_CONFIG_PAUSE_ENABLE_Msk     0x2000UL
#define ETH_NETWORK_CONFIG_RECEIVE_BUFFER_OFFSET_Pos 14UL
#define ETH_NETWORK_CONFIG_RECEIVE_BUFFER_OFFSET_Msk 0xC000UL
#define ETH_NETWORK_CONFIG_LENGTH_FIELD_ERROR_FRAME_DISCARD_Pos 16UL
#define ETH_NETWORK_CONFIG_LENGTH_FIELD_ERROR_FRAME_DISCARD_Msk 0x10000UL
#define ETH_NETWORK_CONFIG_FCS_REMOVE_Pos       17UL
#define ETH_NETWORK_CONFIG_FCS_REMOVE_Msk       0x20000UL
#define ETH_NETWORK_CONFIG_MDC_CLOCK_DIVISION_Pos 18UL
#define ETH_NETWORK_CONFIG_MDC_CLOCK_DIVISION_Msk 0x1C0000UL
#define ETH_NETWORK_CONFIG_DATA_BUS_WIDTH_Pos   21UL
#define ETH_NETWORK_CONFIG_DATA_BUS_WIDTH_Msk   0x600000UL
#define ETH_NETWORK_CONFIG_DISABLE_COPY_OF_PAUSE_FRAMES_Pos 23UL
#define ETH_NETWORK_CONFIG_DISABLE_COPY_OF_PAUSE_FRAMES_Msk 0x800000UL
#define ETH_NETWORK_CONFIG_RECEIVE_CHECKSUM_OFFLOAD_ENABLE_Pos 24UL
#define ETH_NETWORK_CONFIG_RECEIVE_CHECKSUM_OFFLOAD_ENABLE_Msk 0x1000000UL
#define ETH_NETWORK_CONFIG_EN_HALF_DUPLEX_RX_Pos 25UL
#define ETH_NETWORK_CONFIG_EN_HALF_DUPLEX_RX_Msk 0x2000000UL
#define ETH_NETWORK_CONFIG_IGNORE_RX_FCS_Pos    26UL
#define ETH_NETWORK_CONFIG_IGNORE_RX_FCS_Msk    0x4000000UL
#define ETH_NETWORK_CONFIG_SGMII_MODE_ENABLE_Pos 27UL
#define ETH_NETWORK_CONFIG_SGMII_MODE_ENABLE_Msk 0x8000000UL
#define ETH_NETWORK_CONFIG_IPG_STRETCH_ENABLE_Pos 28UL
#define ETH_NETWORK_CONFIG_IPG_STRETCH_ENABLE_Msk 0x10000000UL
#define ETH_NETWORK_CONFIG_NSP_CHANGE_Pos       29UL
#define ETH_NETWORK_CONFIG_NSP_CHANGE_Msk       0x20000000UL
#define ETH_NETWORK_CONFIG_IGNORE_IPG_RX_ER_Pos 30UL
#define ETH_NETWORK_CONFIG_IGNORE_IPG_RX_ER_Msk 0x40000000UL
#define ETH_NETWORK_CONFIG_RESERVED_31_Pos      31UL
#define ETH_NETWORK_CONFIG_RESERVED_31_Msk      0x80000000UL
/* ETH.NETWORK_STATUS */
#define ETH_NETWORK_STATUS_PCS_LINK_STATE_Pos   0UL
#define ETH_NETWORK_STATUS_PCS_LINK_STATE_Msk   0x1UL
#define ETH_NETWORK_STATUS_MDIO_IN_Pos          1UL
#define ETH_NETWORK_STATUS_MDIO_IN_Msk          0x2UL
#define ETH_NETWORK_STATUS_MAN_DONE_Pos         2UL
#define ETH_NETWORK_STATUS_MAN_DONE_Msk         0x4UL
#define ETH_NETWORK_STATUS_MAC_FULL_DUPLEX_Pos  3UL
#define ETH_NETWORK_STATUS_MAC_FULL_DUPLEX_Msk  0x8UL
#define ETH_NETWORK_STATUS_REMOVED_5_4_Pos      4UL
#define ETH_NETWORK_STATUS_REMOVED_5_4_Msk      0x30UL
#define ETH_NETWORK_STATUS_PFC_NEGOTIATE_PCLK_Pos 6UL
#define ETH_NETWORK_STATUS_PFC_NEGOTIATE_PCLK_Msk 0x40UL
#define ETH_NETWORK_STATUS_LPI_INDICATE_PCLK_Pos 7UL
#define ETH_NETWORK_STATUS_LPI_INDICATE_PCLK_Msk 0x80UL
/* ETH.USER_IO_REGISTER */
#define ETH_USER_IO_REGISTER_RESERVED_31_0_Pos  0UL
#define ETH_USER_IO_REGISTER_RESERVED_31_0_Msk  0xFFFFFFFFUL
/* ETH.DMA_CONFIG */
#define ETH_DMA_CONFIG_AMBA_BURST_LENGTH_Pos    0UL
#define ETH_DMA_CONFIG_AMBA_BURST_LENGTH_Msk    0x1FUL
#define ETH_DMA_CONFIG_HDR_DATA_SPLITTING_EN_Pos 5UL
#define ETH_DMA_CONFIG_HDR_DATA_SPLITTING_EN_Msk 0x20UL
#define ETH_DMA_CONFIG_ENDIAN_SWAP_MANAGEMENT_Pos 6UL
#define ETH_DMA_CONFIG_ENDIAN_SWAP_MANAGEMENT_Msk 0x40UL
#define ETH_DMA_CONFIG_ENDIAN_SWAP_PACKET_Pos   7UL
#define ETH_DMA_CONFIG_ENDIAN_SWAP_PACKET_Msk   0x80UL
#define ETH_DMA_CONFIG_RX_PBUF_SIZE_Pos         8UL
#define ETH_DMA_CONFIG_RX_PBUF_SIZE_Msk         0x300UL
#define ETH_DMA_CONFIG_TX_PBUF_SIZE_Pos         10UL
#define ETH_DMA_CONFIG_TX_PBUF_SIZE_Msk         0x400UL
#define ETH_DMA_CONFIG_TX_PBUF_TCP_EN_Pos       11UL
#define ETH_DMA_CONFIG_TX_PBUF_TCP_EN_Msk       0x800UL
#define ETH_DMA_CONFIG_INFINITE_LAST_DBUF_SIZE_EN_Pos 12UL
#define ETH_DMA_CONFIG_INFINITE_LAST_DBUF_SIZE_EN_Msk 0x1000UL
#define ETH_DMA_CONFIG_CRC_ERROR_REPORT_Pos     13UL
#define ETH_DMA_CONFIG_CRC_ERROR_REPORT_Msk     0x2000UL
#define ETH_DMA_CONFIG_RX_BUF_SIZE_Pos          16UL
#define ETH_DMA_CONFIG_RX_BUF_SIZE_Msk          0xFF0000UL
#define ETH_DMA_CONFIG_FORCE_DISCARD_ON_ERR_Pos 24UL
#define ETH_DMA_CONFIG_FORCE_DISCARD_ON_ERR_Msk 0x1000000UL
#define ETH_DMA_CONFIG_FORCE_MAX_AMBA_BURST_RX_Pos 25UL
#define ETH_DMA_CONFIG_FORCE_MAX_AMBA_BURST_RX_Msk 0x2000000UL
#define ETH_DMA_CONFIG_FORCE_MAX_AMBA_BURST_TX_Pos 26UL
#define ETH_DMA_CONFIG_FORCE_MAX_AMBA_BURST_TX_Msk 0x4000000UL
#define ETH_DMA_CONFIG_RX_BD_EXTENDED_MODE_EN_Pos 28UL
#define ETH_DMA_CONFIG_RX_BD_EXTENDED_MODE_EN_Msk 0x10000000UL
#define ETH_DMA_CONFIG_TX_BD_EXTENDED_MODE_EN_Pos 29UL
#define ETH_DMA_CONFIG_TX_BD_EXTENDED_MODE_EN_Msk 0x20000000UL
#define ETH_DMA_CONFIG_DMA_ADDR_BUS_WIDTH_1_Pos 30UL
#define ETH_DMA_CONFIG_DMA_ADDR_BUS_WIDTH_1_Msk 0x40000000UL
/* ETH.TRANSMIT_STATUS */
#define ETH_TRANSMIT_STATUS_USED_BIT_READ_Pos   0UL
#define ETH_TRANSMIT_STATUS_USED_BIT_READ_Msk   0x1UL
#define ETH_TRANSMIT_STATUS_COLLISION_OCCURRED_Pos 1UL
#define ETH_TRANSMIT_STATUS_COLLISION_OCCURRED_Msk 0x2UL
#define ETH_TRANSMIT_STATUS_RETRY_LIMIT_EXCEEDED_Pos 2UL
#define ETH_TRANSMIT_STATUS_RETRY_LIMIT_EXCEEDED_Msk 0x4UL
#define ETH_TRANSMIT_STATUS_TRANSMIT_GO_Pos     3UL
#define ETH_TRANSMIT_STATUS_TRANSMIT_GO_Msk     0x8UL
#define ETH_TRANSMIT_STATUS_AMBA_ERROR123_Pos   4UL
#define ETH_TRANSMIT_STATUS_AMBA_ERROR123_Msk   0x10UL
#define ETH_TRANSMIT_STATUS_TRANSMIT_COMPLETE123_Pos 5UL
#define ETH_TRANSMIT_STATUS_TRANSMIT_COMPLETE123_Msk 0x20UL
#define ETH_TRANSMIT_STATUS_TRANSMIT_UNDER_RUN123_Pos 6UL
#define ETH_TRANSMIT_STATUS_TRANSMIT_UNDER_RUN123_Msk 0x40UL
#define ETH_TRANSMIT_STATUS_LATE_COLLISION_OCCURRED_Pos 7UL
#define ETH_TRANSMIT_STATUS_LATE_COLLISION_OCCURRED_Msk 0x80UL
#define ETH_TRANSMIT_STATUS_RESP_NOT_OK123_Pos  8UL
#define ETH_TRANSMIT_STATUS_RESP_NOT_OK123_Msk  0x100UL
/* ETH.RECEIVE_Q_PTR */
#define ETH_RECEIVE_Q_PTR_DMA_RX_DIS_Q_Pos      0UL
#define ETH_RECEIVE_Q_PTR_DMA_RX_DIS_Q_Msk      0x1UL
#define ETH_RECEIVE_Q_PTR_DMA_RX_Q_PTR_Pos      2UL
#define ETH_RECEIVE_Q_PTR_DMA_RX_Q_PTR_Msk      0xFFFFFFFCUL
/* ETH.TRANSMIT_Q_PTR */
#define ETH_TRANSMIT_Q_PTR_DMA_TX_DIS_Q_Pos     0UL
#define ETH_TRANSMIT_Q_PTR_DMA_TX_DIS_Q_Msk     0x1UL
#define ETH_TRANSMIT_Q_PTR_DMA_TX_Q_PTR_Pos     2UL
#define ETH_TRANSMIT_Q_PTR_DMA_TX_Q_PTR_Msk     0xFFFFFFFCUL
/* ETH.RECEIVE_STATUS */
#define ETH_RECEIVE_STATUS_BUFFER_NOT_AVAILABLE_Pos 0UL
#define ETH_RECEIVE_STATUS_BUFFER_NOT_AVAILABLE_Msk 0x1UL
#define ETH_RECEIVE_STATUS_FRAME_RECEIVED_Pos   1UL
#define ETH_RECEIVE_STATUS_FRAME_RECEIVED_Msk   0x2UL
#define ETH_RECEIVE_STATUS_RECEIVE_OVERRUN123_Pos 2UL
#define ETH_RECEIVE_STATUS_RECEIVE_OVERRUN123_Msk 0x4UL
#define ETH_RECEIVE_STATUS_RESP_NOT_OK1234_Pos  3UL
#define ETH_RECEIVE_STATUS_RESP_NOT_OK1234_Msk  0x8UL
/* ETH.INT_STATUS */
#define ETH_INT_STATUS_MANAGEMENT_FRAME_SENT_Pos 0UL
#define ETH_INT_STATUS_MANAGEMENT_FRAME_SENT_Msk 0x1UL
#define ETH_INT_STATUS_RECEIVE_COMPLETE_Pos     1UL
#define ETH_INT_STATUS_RECEIVE_COMPLETE_Msk     0x2UL
#define ETH_INT_STATUS_RX_USED_BIT_READ_Pos     2UL
#define ETH_INT_STATUS_RX_USED_BIT_READ_Msk     0x4UL
#define ETH_INT_STATUS_TX_USED_BIT_READ_Pos     3UL
#define ETH_INT_STATUS_TX_USED_BIT_READ_Msk     0x8UL
#define ETH_INT_STATUS_TRANSMIT_UNDER_RUN_Pos   4UL
#define ETH_INT_STATUS_TRANSMIT_UNDER_RUN_Msk   0x10UL
#define ETH_INT_STATUS_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_Pos 5UL
#define ETH_INT_STATUS_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_Msk 0x20UL
#define ETH_INT_STATUS_AMBA_ERROR_Pos           6UL
#define ETH_INT_STATUS_AMBA_ERROR_Msk           0x40UL
#define ETH_INT_STATUS_TRANSMIT_COMPLETE_Pos    7UL
#define ETH_INT_STATUS_TRANSMIT_COMPLETE_Msk    0x80UL
#define ETH_INT_STATUS_REMOVED_9_Pos            9UL
#define ETH_INT_STATUS_REMOVED_9_Msk            0x200UL
#define ETH_INT_STATUS_RECEIVE_OVERRUN_Pos      10UL
#define ETH_INT_STATUS_RECEIVE_OVERRUN_Msk      0x400UL
#define ETH_INT_STATUS_RESP_NOT_OK_Pos          11UL
#define ETH_INT_STATUS_RESP_NOT_OK_Msk          0x800UL
#define ETH_INT_STATUS_PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_RECEIVED_Pos 12UL
#define ETH_INT_STATUS_PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_RECEIVED_Msk 0x1000UL
#define ETH_INT_STATUS_PAUSE_TIME_ELAPSED_Pos   13UL
#define ETH_INT_STATUS_PAUSE_TIME_ELAPSED_Msk   0x2000UL
#define ETH_INT_STATUS_PAUSE_FRAME_TRANSMITTED_Pos 14UL
#define ETH_INT_STATUS_PAUSE_FRAME_TRANSMITTED_Msk 0x4000UL
#define ETH_INT_STATUS_REMOVED_15_Pos           15UL
#define ETH_INT_STATUS_REMOVED_15_Msk           0x8000UL
#define ETH_INT_STATUS_REMOVED_16_Pos           16UL
#define ETH_INT_STATUS_REMOVED_16_Msk           0x10000UL
#define ETH_INT_STATUS_REMOVED_17_Pos           17UL
#define ETH_INT_STATUS_REMOVED_17_Msk           0x20000UL
#define ETH_INT_STATUS_PTP_DELAY_REQ_FRAME_RECEIVED_Pos 18UL
#define ETH_INT_STATUS_PTP_DELAY_REQ_FRAME_RECEIVED_Msk 0x40000UL
#define ETH_INT_STATUS_PTP_SYNC_FRAME_RECEIVED_Pos 19UL
#define ETH_INT_STATUS_PTP_SYNC_FRAME_RECEIVED_Msk 0x80000UL
#define ETH_INT_STATUS_PTP_DELAY_REQ_FRAME_TRANSMITTED_Pos 20UL
#define ETH_INT_STATUS_PTP_DELAY_REQ_FRAME_TRANSMITTED_Msk 0x100000UL
#define ETH_INT_STATUS_PTP_SYNC_FRAME_TRANSMITTED_Pos 21UL
#define ETH_INT_STATUS_PTP_SYNC_FRAME_TRANSMITTED_Msk 0x200000UL
#define ETH_INT_STATUS_PTP_PDELAY_REQ_FRAME_RECEIVED_Pos 22UL
#define ETH_INT_STATUS_PTP_PDELAY_REQ_FRAME_RECEIVED_Msk 0x400000UL
#define ETH_INT_STATUS_PTP_PDELAY_RESP_FRAME_RECEIVED_Pos 23UL
#define ETH_INT_STATUS_PTP_PDELAY_RESP_FRAME_RECEIVED_Msk 0x800000UL
#define ETH_INT_STATUS_PTP_PDELAY_REQ_FRAME_TRANSMITTED_Pos 24UL
#define ETH_INT_STATUS_PTP_PDELAY_REQ_FRAME_TRANSMITTED_Msk 0x1000000UL
#define ETH_INT_STATUS_PTP_PDELAY_RESP_FRAME_TRANSMITTED_Pos 25UL
#define ETH_INT_STATUS_PTP_PDELAY_RESP_FRAME_TRANSMITTED_Msk 0x2000000UL
#define ETH_INT_STATUS_TSU_SECONDS_REGISTER_INCREMENT_Pos 26UL
#define ETH_INT_STATUS_TSU_SECONDS_REGISTER_INCREMENT_Msk 0x4000000UL
#define ETH_INT_STATUS_RECEIVE_LPI_INDICATION_STATUS_BIT_CHANGE_Pos 27UL
#define ETH_INT_STATUS_RECEIVE_LPI_INDICATION_STATUS_BIT_CHANGE_Msk 0x8000000UL
#define ETH_INT_STATUS_REMOVED_28_Pos           28UL
#define ETH_INT_STATUS_REMOVED_28_Msk           0x10000000UL
#define ETH_INT_STATUS_TSU_TIMER_COMPARISON_INTERRUPT_Pos 29UL
#define ETH_INT_STATUS_TSU_TIMER_COMPARISON_INTERRUPT_Msk 0x20000000UL
/* ETH.INT_ENABLE */
#define ETH_INT_ENABLE_ENABLE_MANAGEMENT_DONE_INTERRUPT_Pos 0UL
#define ETH_INT_ENABLE_ENABLE_MANAGEMENT_DONE_INTERRUPT_Msk 0x1UL
#define ETH_INT_ENABLE_ENABLE_RECEIVE_COMPLETE_INTERRUPT_Pos 1UL
#define ETH_INT_ENABLE_ENABLE_RECEIVE_COMPLETE_INTERRUPT_Msk 0x2UL
#define ETH_INT_ENABLE_ENABLE_RECEIVE_USED_BIT_READ_INTERRUPT_Pos 2UL
#define ETH_INT_ENABLE_ENABLE_RECEIVE_USED_BIT_READ_INTERRUPT_Msk 0x4UL
#define ETH_INT_ENABLE_ENABLE_TRANSMIT_USED_BIT_READ_INTERRUPT_Pos 3UL
#define ETH_INT_ENABLE_ENABLE_TRANSMIT_USED_BIT_READ_INTERRUPT_Msk 0x8UL
#define ETH_INT_ENABLE_ENABLE_TRANSMIT_BUFFER_UNDER_RUN_INTERRUPT_Pos 4UL
#define ETH_INT_ENABLE_ENABLE_TRANSMIT_BUFFER_UNDER_RUN_INTERRUPT_Msk 0x10UL
#define ETH_INT_ENABLE_ENABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Pos 5UL
#define ETH_INT_ENABLE_ENABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Msk 0x20UL
#define ETH_INT_ENABLE_ENABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Pos 6UL
#define ETH_INT_ENABLE_ENABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Msk 0x40UL
#define ETH_INT_ENABLE_ENABLE_TRANSMIT_COMPLETE_INTERRUPT_Pos 7UL
#define ETH_INT_ENABLE_ENABLE_TRANSMIT_COMPLETE_INTERRUPT_Msk 0x80UL
#define ETH_INT_ENABLE_UNUSED_8_Pos             8UL
#define ETH_INT_ENABLE_UNUSED_8_Msk             0x100UL
#define ETH_INT_ENABLE_UNUSED_9_Pos             9UL
#define ETH_INT_ENABLE_UNUSED_9_Msk             0x200UL
#define ETH_INT_ENABLE_ENABLE_RECEIVE_OVERRUN_INTERRUPT_Pos 10UL
#define ETH_INT_ENABLE_ENABLE_RECEIVE_OVERRUN_INTERRUPT_Msk 0x400UL
#define ETH_INT_ENABLE_ENABLE_RESP_NOT_OK_INTERRUPT_Pos 11UL
#define ETH_INT_ENABLE_ENABLE_RESP_NOT_OK_INTERRUPT_Msk 0x800UL
#define ETH_INT_ENABLE_ENABLE_PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_INTERRUPT_Pos 12UL
#define ETH_INT_ENABLE_ENABLE_PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_INTERRUPT_Msk 0x1000UL
#define ETH_INT_ENABLE_ENABLE_PAUSE_TIME_ZERO_INTERRUPT_Pos 13UL
#define ETH_INT_ENABLE_ENABLE_PAUSE_TIME_ZERO_INTERRUPT_Msk 0x2000UL
#define ETH_INT_ENABLE_ENABLE_PAUSE_FRAME_TRANSMITTED_INTERRUPT_Pos 14UL
#define ETH_INT_ENABLE_ENABLE_PAUSE_FRAME_TRANSMITTED_INTERRUPT_Msk 0x4000UL
#define ETH_INT_ENABLE_UNUSED_15_Pos            15UL
#define ETH_INT_ENABLE_UNUSED_15_Msk            0x8000UL
#define ETH_INT_ENABLE_UNUSED_16_Pos            16UL
#define ETH_INT_ENABLE_UNUSED_16_Msk            0x10000UL
#define ETH_INT_ENABLE_UNUSED_17_Pos            17UL
#define ETH_INT_ENABLE_UNUSED_17_Msk            0x20000UL
#define ETH_INT_ENABLE_ENABLE_PTP_DELAY_REQ_FRAME_RECEIVED_Pos 18UL
#define ETH_INT_ENABLE_ENABLE_PTP_DELAY_REQ_FRAME_RECEIVED_Msk 0x40000UL
#define ETH_INT_ENABLE_ENABLE_PTP_SYNC_FRAME_RECEIVED_Pos 19UL
#define ETH_INT_ENABLE_ENABLE_PTP_SYNC_FRAME_RECEIVED_Msk 0x80000UL
#define ETH_INT_ENABLE_ENABLE_PTP_DELAY_REQ_FRAME_TRANSMITTED_Pos 20UL
#define ETH_INT_ENABLE_ENABLE_PTP_DELAY_REQ_FRAME_TRANSMITTED_Msk 0x100000UL
#define ETH_INT_ENABLE_ENABLE_PTP_SYNC_FRAME_TRANSMITTED_Pos 21UL
#define ETH_INT_ENABLE_ENABLE_PTP_SYNC_FRAME_TRANSMITTED_Msk 0x200000UL
#define ETH_INT_ENABLE_ENABLE_PTP_PDELAY_REQ_FRAME_RECEIVED_Pos 22UL
#define ETH_INT_ENABLE_ENABLE_PTP_PDELAY_REQ_FRAME_RECEIVED_Msk 0x400000UL
#define ETH_INT_ENABLE_ENABLE_PTP_PDELAY_RESP_FRAME_RECEIVED_Pos 23UL
#define ETH_INT_ENABLE_ENABLE_PTP_PDELAY_RESP_FRAME_RECEIVED_Msk 0x800000UL
#define ETH_INT_ENABLE_ENABLE_PTP_PDELAY_REQ_FRAME_TRANSMITTED_Pos 24UL
#define ETH_INT_ENABLE_ENABLE_PTP_PDELAY_REQ_FRAME_TRANSMITTED_Msk 0x1000000UL
#define ETH_INT_ENABLE_ENABLE_PTP_PDELAY_RESP_FRAME_TRANSMITTED_Pos 25UL
#define ETH_INT_ENABLE_ENABLE_PTP_PDELAY_RESP_FRAME_TRANSMITTED_Msk 0x2000000UL
#define ETH_INT_ENABLE_ENABLE_TSU_SECONDS_REGISTER_INCREMENT_Pos 26UL
#define ETH_INT_ENABLE_ENABLE_TSU_SECONDS_REGISTER_INCREMENT_Msk 0x4000000UL
#define ETH_INT_ENABLE_ENABLE_RX_LPI_INDICATION_INTERRUPT_Pos 27UL
#define ETH_INT_ENABLE_ENABLE_RX_LPI_INDICATION_INTERRUPT_Msk 0x8000000UL
#define ETH_INT_ENABLE_UNUSED_28_Pos            28UL
#define ETH_INT_ENABLE_UNUSED_28_Msk            0x10000000UL
#define ETH_INT_ENABLE_ENABLE_TSU_TIMER_COMPARISON_INTERRUPT_Pos 29UL
#define ETH_INT_ENABLE_ENABLE_TSU_TIMER_COMPARISON_INTERRUPT_Msk 0x20000000UL
/* ETH.INT_DISABLE */
#define ETH_INT_DISABLE_DISABLE_MANAGEMENT_DONE_INTERRUPT_Pos 0UL
#define ETH_INT_DISABLE_DISABLE_MANAGEMENT_DONE_INTERRUPT_Msk 0x1UL
#define ETH_INT_DISABLE_DISABLE_RECEIVE_COMPLETE_INTERRUPT_Pos 1UL
#define ETH_INT_DISABLE_DISABLE_RECEIVE_COMPLETE_INTERRUPT_Msk 0x2UL
#define ETH_INT_DISABLE_DISABLE_RECEIVE_USED_BIT_READ_INTERRUPT_Pos 2UL
#define ETH_INT_DISABLE_DISABLE_RECEIVE_USED_BIT_READ_INTERRUPT_Msk 0x4UL
#define ETH_INT_DISABLE_DISABLE_TRANSMIT_USED_BIT_READ_INTERRUPT_Pos 3UL
#define ETH_INT_DISABLE_DISABLE_TRANSMIT_USED_BIT_READ_INTERRUPT_Msk 0x8UL
#define ETH_INT_DISABLE_DISABLE_TRANSMIT_BUFFER_UNDER_RUN_INTERRUPT_Pos 4UL
#define ETH_INT_DISABLE_DISABLE_TRANSMIT_BUFFER_UNDER_RUN_INTERRUPT_Msk 0x10UL
#define ETH_INT_DISABLE_DISABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Pos 5UL
#define ETH_INT_DISABLE_DISABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT_Msk 0x20UL
#define ETH_INT_DISABLE_DISABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Pos 6UL
#define ETH_INT_DISABLE_DISABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT_Msk 0x40UL
#define ETH_INT_DISABLE_DISABLE_TRANSMIT_COMPLETE_INTERRUPT_Pos 7UL
#define ETH_INT_DISABLE_DISABLE_TRANSMIT_COMPLETE_INTERRUPT_Msk 0x80UL
#define ETH_INT_DISABLE_UNUSED_8_Pos            8UL
#define ETH_INT_DISABLE_UNUSED_8_Msk            0x100UL
#define ETH_INT_DISABLE_UNUSED_9_Pos            9UL
#define ETH_INT_DISABLE_UNUSED_9_Msk            0x200UL
#define ETH_INT_DISABLE_DISABLE_RECEIVE_OVERRUN_INTERRUPT_Pos 10UL
#define ETH_INT_DISABLE_DISABLE_RECEIVE_OVERRUN_INTERRUPT_Msk 0x400UL
#define ETH_INT_DISABLE_DISABLE_RESP_NOT_OK_INTERRUPT_Pos 11UL
#define ETH_INT_DISABLE_DISABLE_RESP_NOT_OK_INTERRUPT_Msk 0x800UL
#define ETH_INT_DISABLE_DISABLE_PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_INTERRUPT_Pos 12UL
#define ETH_INT_DISABLE_DISABLE_PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_INTERRUPT_Msk 0x1000UL
#define ETH_INT_DISABLE_DISABLE_PAUSE_TIME_ZERO_INTERRUPT_Pos 13UL
#define ETH_INT_DISABLE_DISABLE_PAUSE_TIME_ZERO_INTERRUPT_Msk 0x2000UL
#define ETH_INT_DISABLE_DISABLE_PAUSE_FRAME_TRANSMITTED_INTERRUPT_Pos 14UL
#define ETH_INT_DISABLE_DISABLE_PAUSE_FRAME_TRANSMITTED_INTERRUPT_Msk 0x4000UL
#define ETH_INT_DISABLE_UNUSED_15_Pos           15UL
#define ETH_INT_DISABLE_UNUSED_15_Msk           0x8000UL
#define ETH_INT_DISABLE_UNUSED_16_Pos           16UL
#define ETH_INT_DISABLE_UNUSED_16_Msk           0x10000UL
#define ETH_INT_DISABLE_UNUSED_17_Pos           17UL
#define ETH_INT_DISABLE_UNUSED_17_Msk           0x20000UL
#define ETH_INT_DISABLE_DISABLE_PTP_DELAY_REQ_FRAME_RECEIVED_Pos 18UL
#define ETH_INT_DISABLE_DISABLE_PTP_DELAY_REQ_FRAME_RECEIVED_Msk 0x40000UL
#define ETH_INT_DISABLE_DISABLE_PTP_SYNC_FRAME_RECEIVED_Pos 19UL
#define ETH_INT_DISABLE_DISABLE_PTP_SYNC_FRAME_RECEIVED_Msk 0x80000UL
#define ETH_INT_DISABLE_DISABLE_PTP_DELAY_REQ_FRAME_TRANSMITTED_Pos 20UL
#define ETH_INT_DISABLE_DISABLE_PTP_DELAY_REQ_FRAME_TRANSMITTED_Msk 0x100000UL
#define ETH_INT_DISABLE_DISABLE_PTP_SYNC_FRAME_TRANSMITTED_Pos 21UL
#define ETH_INT_DISABLE_DISABLE_PTP_SYNC_FRAME_TRANSMITTED_Msk 0x200000UL
#define ETH_INT_DISABLE_DISABLE_PTP_PDELAY_REQ_FRAME_RECEIVED_Pos 22UL
#define ETH_INT_DISABLE_DISABLE_PTP_PDELAY_REQ_FRAME_RECEIVED_Msk 0x400000UL
#define ETH_INT_DISABLE_DISABLE_PTP_PDELAY_RESP_FRAME_RECEIVED_Pos 23UL
#define ETH_INT_DISABLE_DISABLE_PTP_PDELAY_RESP_FRAME_RECEIVED_Msk 0x800000UL
#define ETH_INT_DISABLE_DISABLE_PTP_PDELAY_REQ_FRAME_TRANSMITTED_Pos 24UL
#define ETH_INT_DISABLE_DISABLE_PTP_PDELAY_REQ_FRAME_TRANSMITTED_Msk 0x1000000UL
#define ETH_INT_DISABLE_DISABLE_PTP_PDELAY_RESP_FRAME_TRANSMITTED_Pos 25UL
#define ETH_INT_DISABLE_DISABLE_PTP_PDELAY_RESP_FRAME_TRANSMITTED_Msk 0x2000000UL
#define ETH_INT_DISABLE_DISABLE_TSU_SECONDS_REGISTER_INCREMENT_Pos 26UL
#define ETH_INT_DISABLE_DISABLE_TSU_SECONDS_REGISTER_INCREMENT_Msk 0x4000000UL
