PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_eth_v3.h
#define ETH_INT_DISABLE_DISABLE_RX_LPI_INDICATION_INTERRUPT_Pos 27UL
#define ETH_INT_DISABLE_DISABLE_RX_LPI_INDICATION_INTERRUPT_Msk 0x8000000UL
#define ETH_INT_DISABLE_UNUSED_28_Pos           28UL
#define ETH_INT_DISABLE_UNUSED_28_Msk           0x10000000UL
#define ETH_INT_DISABLE_DISABLE_TSU_TIMER_COMPARISON_INTERRUPT_Pos 29UL
#define ETH_INT_DISABLE_DISABLE_TSU_TIMER_COMPARISON_INTERRUPT_Msk 0x20000000UL
#define ETH_INT_DISABLE_RESERVED_30_30_Pos      30UL
#define ETH_INT_DISABLE_RESERVED_30_30_Msk      0x40000000UL
#define ETH_INT_DISABLE_RESERVED_31_31_Pos      31UL
#define ETH_INT_DISABLE_RESERVED_31_31_Msk      0x80000000UL
/* ETH.INT_MASK */
#define ETH_INT_MASK_MANAGEMENT_DONE_INTERRUPT_MASK_Pos 0UL
#define ETH_INT_MASK_MANAGEMENT_DONE_INTERRUPT_MASK_Msk 0x1UL
#define ETH_INT_MASK_RECEIVE_COMPLETE_INTERRUPT_MASK_Pos 1UL
#define ETH_INT_MASK_RECEIVE_COMPLETE_INTERRUPT_MASK_Msk 0x2UL
#define ETH_INT_MASK_RECEIVE_USED_BIT_READ_INTERRUPT_MASK_Pos 2UL
#define ETH_INT_MASK_RECEIVE_USED_BIT_READ_INTERRUPT_MASK_Msk 0x4UL
#define ETH_INT_MASK_TRANSMIT_USED_BIT_READ_INTERRUPT_MASK_Pos 3UL
#define ETH_INT_MASK_TRANSMIT_USED_BIT_READ_INTERRUPT_MASK_Msk 0x8UL
#define ETH_INT_MASK_TRANSMIT_BUFFER_UNDER_RUN_INTERRUPT_MASK_Pos 4UL
#define ETH_INT_MASK_TRANSMIT_BUFFER_UNDER_RUN_INTERRUPT_MASK_Msk 0x10UL
#define ETH_INT_MASK_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_MASK_Pos 5UL
#define ETH_INT_MASK_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_MASK_Msk 0x20UL
#define ETH_INT_MASK_AMBA_ERROR_INTERRUPT_MASK_Pos 6UL
#define ETH_INT_MASK_AMBA_ERROR_INTERRUPT_MASK_Msk 0x40UL
#define ETH_INT_MASK_TRANSMIT_COMPLETE_INTERRUPT_MASK_Pos 7UL
#define ETH_INT_MASK_TRANSMIT_COMPLETE_INTERRUPT_MASK_Msk 0x80UL
#define ETH_INT_MASK_UNUSED_8_Pos               8UL
#define ETH_INT_MASK_UNUSED_8_Msk               0x100UL
#define ETH_INT_MASK_UNUSED_9_Pos               9UL
#define ETH_INT_MASK_UNUSED_9_Msk               0x200UL
#define ETH_INT_MASK_RECEIVE_OVERRUN_INTERRUPT_MASK_Pos 10UL
#define ETH_INT_MASK_RECEIVE_OVERRUN_INTERRUPT_MASK_Msk 0x400UL
#define ETH_INT_MASK_RESP_NOT_OK_INTERRUPT_MASK_Pos 11UL
#define ETH_INT_MASK_RESP_NOT_OK_INTERRUPT_MASK_Msk 0x800UL
#define ETH_INT_MASK_PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_INTERRUPT_MASK_Pos 12UL
#define ETH_INT_MASK_PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_INTERRUPT_MASK_Msk 0x1000UL
#define ETH_INT_MASK_PAUSE_TIME_ZERO_INTERRUPT_MASK_Pos 13UL
#define ETH_INT_MASK_PAUSE_TIME_ZERO_INTERRUPT_MASK_Msk 0x2000UL
#define ETH_INT_MASK_PAUSE_FRAME_TRANSMITTED_INTERRUPT_MASK_Pos 14UL
#define ETH_INT_MASK_PAUSE_FRAME_TRANSMITTED_INTERRUPT_MASK_Msk 0x4000UL
#define ETH_INT_MASK_UNUSED_15_Pos              15UL
#define ETH_INT_MASK_UNUSED_15_Msk              0x8000UL
#define ETH_INT_MASK_UNUSED_16_Pos              16UL
#define ETH_INT_MASK_UNUSED_16_Msk              0x10000UL
#define ETH_INT_MASK_UNUSED_17_Pos              17UL
#define ETH_INT_MASK_UNUSED_17_Msk              0x20000UL
#define ETH_INT_MASK_PTP_DELAY_REQ_FRAME_RECEIVED_MASK_Pos 18UL
#define ETH_INT_MASK_PTP_DELAY_REQ_FRAME_RECEIVED_MASK_Msk 0x40000UL
#define ETH_INT_MASK_PTP_SYNC_FRAME_RECEIVED_MASK_Pos 19UL
#define ETH_INT_MASK_PTP_SYNC_FRAME_RECEIVED_MASK_Msk 0x80000UL
#define ETH_INT_MASK_PTP_DELAY_REQ_FRAME_TRANSMITTED_MASK_Pos 20UL
#define ETH_INT_MASK_PTP_DELAY_REQ_FRAME_TRANSMITTED_MASK_Msk 0x100000UL
#define ETH_INT_MASK_PTP_SYNC_FRAME_TRANSMITTED_MASK_Pos 21UL
#define ETH_INT_MASK_PTP_SYNC_FRAME_TRANSMITTED_MASK_Msk 0x200000UL
#define ETH_INT_MASK_PTP_PDELAY_REQ_FRAME_RECEIVED_MASK_Pos 22UL
#define ETH_INT_MASK_PTP_PDELAY_REQ_FRAME_RECEIVED_MASK_Msk 0x400000UL
#define ETH_INT_MASK_PTP_PDELAY_RESP_FRAME_RECEIVED_MASK_Pos 23UL
#define ETH_INT_MASK_PTP_PDELAY_RESP_FRAME_RECEIVED_MASK_Msk 0x800000UL
#define ETH_INT_MASK_PTP_PDELAY_REQ_FRAME_TRANSMITTED_MASK_Pos 24UL
#define ETH_INT_MASK_PTP_PDELAY_REQ_FRAME_TRANSMITTED_MASK_Msk 0x1000000UL
#define ETH_INT_MASK_PTP_PDELAY_RESP_FRAME_TRANSMITTED_MASK_Pos 25UL
#define ETH_INT_MASK_PTP_PDELAY_RESP_FRAME_TRANSMITTED_MASK_Msk 0x2000000UL
#define ETH_INT_MASK_TSU_SECONDS_REGISTER_INCREMENT_MASK_Pos 26UL
#define ETH_INT_MASK_TSU_SECONDS_REGISTER_INCREMENT_MASK_Msk 0x4000000UL
#define ETH_INT_MASK_RX_LPI_INDICATION_MASK_Pos 27UL
#define ETH_INT_MASK_RX_LPI_INDICATION_MASK_Msk 0x8000000UL
#define ETH_INT_MASK_UNUSED_28_Pos              28UL
#define ETH_INT_MASK_UNUSED_28_Msk              0x10000000UL
#define ETH_INT_MASK_TSU_TIMER_COMPARISON_MASK_Pos 29UL
#define ETH_INT_MASK_TSU_TIMER_COMPARISON_MASK_Msk 0x20000000UL
/* ETH.PHY_MANAGEMENT */
#define ETH_PHY_MANAGEMENT_PHY_WRITE_READ_DATA_Pos 0UL
#define ETH_PHY_MANAGEMENT_PHY_WRITE_READ_DATA_Msk 0xFFFFUL
#define ETH_PHY_MANAGEMENT_WRITE10_Pos          16UL
#define ETH_PHY_MANAGEMENT_WRITE10_Msk          0x30000UL
#define ETH_PHY_MANAGEMENT_REGISTER_ADDRESS_Pos 18UL
#define ETH_PHY_MANAGEMENT_REGISTER_ADDRESS_Msk 0x7C0000UL
#define ETH_PHY_MANAGEMENT_PHY_ADDRESS_Pos      23UL
#define ETH_PHY_MANAGEMENT_PHY_ADDRESS_Msk      0xF800000UL
#define ETH_PHY_MANAGEMENT_OPERATION_Pos        28UL
#define ETH_PHY_MANAGEMENT_OPERATION_Msk        0x30000000UL
#define ETH_PHY_MANAGEMENT_WRITE1_Pos           30UL
#define ETH_PHY_MANAGEMENT_WRITE1_Msk           0x40000000UL
#define ETH_PHY_MANAGEMENT_WRITE0_Pos           31UL
#define ETH_PHY_MANAGEMENT_WRITE0_Msk           0x80000000UL
/* ETH.PAUSE_TIME */
#define ETH_PAUSE_TIME_QUANTUM_Pos              0UL
#define ETH_PAUSE_TIME_QUANTUM_Msk              0xFFFFUL
/* ETH.TX_PAUSE_QUANTUM */
#define ETH_TX_PAUSE_QUANTUM_QUANTUM_Pos        0UL
#define ETH_TX_PAUSE_QUANTUM_QUANTUM_Msk        0xFFFFUL
#define ETH_TX_PAUSE_QUANTUM_QUANTUM_P1_Pos     16UL
#define ETH_TX_PAUSE_QUANTUM_QUANTUM_P1_Msk     0xFFFF0000UL
/* ETH.PBUF_TXCUTTHRU */
#define ETH_PBUF_TXCUTTHRU_DMA_TX_CUTTHRU_THRESHOLD_Pos 0UL
#define ETH_PBUF_TXCUTTHRU_DMA_TX_CUTTHRU_THRESHOLD_Msk 0x1FFUL
#define ETH_PBUF_TXCUTTHRU_DMA_TX_CUTTHRU_Pos   31UL
#define ETH_PBUF_TXCUTTHRU_DMA_TX_CUTTHRU_Msk   0x80000000UL
/* ETH.PBUF_RXCUTTHRU */
#define ETH_PBUF_RXCUTTHRU_DMA_RX_CUTTHRU_THRESHOLD_Pos 0UL
#define ETH_PBUF_RXCUTTHRU_DMA_RX_CUTTHRU_THRESHOLD_Msk 0xFFUL
#define ETH_PBUF_RXCUTTHRU_DMA_RX_CUTTHRU_Pos   31UL
#define ETH_PBUF_RXCUTTHRU_DMA_RX_CUTTHRU_Msk   0x80000000UL
/* ETH.JUMBO_MAX_LENGTH */
#define ETH_JUMBO_MAX_LENGTH_JUMBO_MAX_LENGTH_Pos 0UL
#define ETH_JUMBO_MAX_LENGTH_JUMBO_MAX_LENGTH_Msk 0x3FFFUL
/* ETH.EXTERNAL_FIFO_INTERFACE */
#define ETH_EXTERNAL_FIFO_INTERFACE_REMOVED_31_0_Pos 0UL
#define ETH_EXTERNAL_FIFO_INTERFACE_REMOVED_31_0_Msk 0xFFFFFFFFUL
/* ETH.AXI_MAX_PIPELINE */
#define ETH_AXI_MAX_PIPELINE_AR2R_MAX_PIPELINE_Pos 0UL
#define ETH_AXI_MAX_PIPELINE_AR2R_MAX_PIPELINE_Msk 0xFFUL
#define ETH_AXI_MAX_PIPELINE_AW2W_MAX_PIPELINE_Pos 8UL
#define ETH_AXI_MAX_PIPELINE_AW2W_MAX_PIPELINE_Msk 0xFF00UL
#define ETH_AXI_MAX_PIPELINE_USE_AW2B_FILL_Pos  16UL
#define ETH_AXI_MAX_PIPELINE_USE_AW2B_FILL_Msk  0x10000UL
/* ETH.RSC_CONTROL */
#define ETH_RSC_CONTROL_REMOVED_31_0_Pos        0UL
#define ETH_RSC_CONTROL_REMOVED_31_0_Msk        0xFFFFFFFFUL
/* ETH.INT_MODERATION */
#define ETH_INT_MODERATION_RX_INT_MODERATION_Pos 0UL
#define ETH_INT_MODERATION_RX_INT_MODERATION_Msk 0xFFUL
#define ETH_INT_MODERATION_TX_INT_MODERATION_Pos 16UL
#define ETH_INT_MODERATION_TX_INT_MODERATION_Msk 0xFF0000UL
/* ETH.SYS_WAKE_TIME */
#define ETH_SYS_WAKE_TIME_SYS_WAKE_TIME_Pos     0UL
#define ETH_SYS_WAKE_TIME_SYS_WAKE_TIME_Msk     0xFFFFUL
/* ETH.HASH_BOTTOM */
#define ETH_HASH_BOTTOM_ADDRESS_HASH_B_Pos      0UL
#define ETH_HASH_BOTTOM_ADDRESS_HASH_B_Msk      0xFFFFFFFFUL
/* ETH.HASH_TOP */
#define ETH_HASH_TOP_ADDRESS_HASH_T_Pos         0UL
#define ETH_HASH_TOP_ADDRESS_HASH_T_Msk         0xFFFFFFFFUL
/* ETH.SPEC_ADD1_BOTTOM */
#define ETH_SPEC_ADD1_BOTTOM_ADDRESS_ADD1_B_Pos 0UL
#define ETH_SPEC_ADD1_BOTTOM_ADDRESS_ADD1_B_Msk 0xFFFFFFFFUL
/* ETH.SPEC_ADD1_TOP */
#define ETH_SPEC_ADD1_TOP_ADDRESS_TOP_Pos       0UL
#define ETH_SPEC_ADD1_TOP_ADDRESS_TOP_Msk       0xFFFFUL
#define ETH_SPEC_ADD1_TOP_FILTER_TYPE_Pos       16UL
#define ETH_SPEC_ADD1_TOP_FILTER_TYPE_Msk       0x10000UL
/* ETH.SPEC_ADD2_BOTTOM */
#define ETH_SPEC_ADD2_BOTTOM_ADDRESS_BOTTOM_Pos 0UL
#define ETH_SPEC_ADD2_BOTTOM_ADDRESS_BOTTOM_Msk 0xFFFFFFFFUL
/* ETH.SPEC_ADD2_TOP */
#define ETH_SPEC_ADD2_TOP_ADDRESS_TOP_Pos       0UL
#define ETH_SPEC_ADD2_TOP_ADDRESS_TOP_Msk       0xFFFFUL
#define ETH_SPEC_ADD2_TOP_FILTER_TYPE_Pos       16UL
#define ETH_SPEC_ADD2_TOP_FILTER_TYPE_Msk       0x10000UL
#define ETH_SPEC_ADD2_TOP_FILTER_BYTE_MASK_Pos  24UL
#define ETH_SPEC_ADD2_TOP_FILTER_BYTE_MASK_Msk  0x3F000000UL
/* ETH.SPEC_ADD3_BOTTOM */
#define ETH_SPEC_ADD3_BOTTOM_ADDRESS_BOTTOM_Pos 0UL
#define ETH_SPEC_ADD3_BOTTOM_ADDRESS_BOTTOM_Msk 0xFFFFFFFFUL
/* ETH.SPEC_ADD3_TOP */
#define ETH_SPEC_ADD3_TOP_ADDRESS_TOP_Pos       0UL
#define ETH_SPEC_ADD3_TOP_ADDRESS_TOP_Msk       0xFFFFUL
#define ETH_SPEC_ADD3_TOP_FILTER_TYPE_Pos       16UL
#define ETH_SPEC_ADD3_TOP_FILTER_TYPE_Msk       0x10000UL
#define ETH_SPEC_ADD3_TOP_FILTER_BYTE_MASK_Pos  24UL
#define ETH_SPEC_ADD3_TOP_FILTER_BYTE_MASK_Msk  0x3F000000UL
/* ETH.SPEC_ADD4_BOTTOM */
#define ETH_SPEC_ADD4_BOTTOM_ADDRESS_BOTTOM_Pos 0UL
#define ETH_SPEC_ADD4_BOTTOM_ADDRESS_BOTTOM_Msk 0xFFFFFFFFUL
/* ETH.SPEC_ADD4_TOP */
#define ETH_SPEC_ADD4_TOP_ADDRESS_TOP_Pos       0UL
#define ETH_SPEC_ADD4_TOP_ADDRESS_TOP_Msk       0xFFFFUL
#define ETH_SPEC_ADD4_TOP_FILTER_TYPE_Pos       16UL
#define ETH_SPEC_ADD4_TOP_FILTER_TYPE_Msk       0x10000UL
#define ETH_SPEC_ADD4_TOP_FILTER_BYTE_MASK_Pos  24UL
#define ETH_SPEC_ADD4_TOP_FILTER_BYTE_MASK_Msk  0x3F000000UL
/* ETH.SPEC_TYPE1 */
#define ETH_SPEC_TYPE1_MATCH_Pos                0UL
#define ETH_SPEC_TYPE1_MATCH_Msk                0xFFFFUL
#define ETH_SPEC_TYPE1_ENABLE_COPY_Pos          31UL
#define ETH_SPEC_TYPE1_ENABLE_COPY_Msk          0x80000000UL
/* ETH.SPEC_TYPE2 */
#define ETH_SPEC_TYPE2_MATCH_Pos                0UL
#define ETH_SPEC_TYPE2_MATCH_Msk                0xFFFFUL
#define ETH_SPEC_TYPE2_ENABLE_COPY_Pos          31UL
#define ETH_SPEC_TYPE2_ENABLE_COPY_Msk          0x80000000UL
/* ETH.SPEC_TYPE3 */
#define ETH_SPEC_TYPE3_MATCH_Pos                0UL
#define ETH_SPEC_TYPE3_MATCH_Msk                0xFFFFUL
#define ETH_SPEC_TYPE3_ENABLE_COPY_Pos          31UL
#define ETH_SPEC_TYPE3_ENABLE_COPY_Msk          0x80000000UL
/* ETH.SPEC_TYPE4 */
#define ETH_SPEC_TYPE4_MATCH_Pos                0UL
#define ETH_SPEC_TYPE4_MATCH_Msk                0xFFFFUL
#define ETH_SPEC_TYPE4_ENABLE_COPY_Pos          31UL
#define ETH_SPEC_TYPE4_ENABLE_COPY_Msk          0x80000000UL
/* ETH.WOL_REGISTER */
#define ETH_WOL_REGISTER_ADDR_Pos               0UL
#define ETH_WOL_REGISTER_ADDR_Msk               0xFFFFUL
#define ETH_WOL_REGISTER_WOL_MASK_0_Pos         16UL
#define ETH_WOL_REGISTER_WOL_MASK_0_Msk         0x10000UL
#define ETH_WOL_REGISTER_WOL_MASK_1_Pos         17UL
#define ETH_WOL_REGISTER_WOL_MASK_1_Msk         0x20000UL
#define ETH_WOL_REGISTER_WOL_MASK_2_Pos         18UL
#define ETH_WOL_REGISTER_WOL_MASK_2_Msk         0x40000UL
#define ETH_WOL_REGISTER_WOL_MASK_3_Pos         19UL
#define ETH_WOL_REGISTER_WOL_MASK_3_Msk         0x80000UL
/* ETH.STRETCH_RATIO */
#define ETH_STRETCH_RATIO_IPG_STRETCH_Pos       0UL
#define ETH_STRETCH_RATIO_IPG_STRETCH_Msk       0xFFFFUL
/* ETH.STACKED_VLAN */
#define ETH_STACKED_VLAN_MATCH_Pos              0UL
#define ETH_STACKED_VLAN_MATCH_Msk              0xFFFFUL
#define ETH_STACKED_VLAN_ENABLE_PROCESSING_Pos  31UL
#define ETH_STACKED_VLAN_ENABLE_PROCESSING_Msk  0x80000000UL
/* ETH.TX_PFC_PAUSE */
#define ETH_TX_PFC_PAUSE_VECTOR_ENABLE_Pos      0UL
#define ETH_TX_PFC_PAUSE_VECTOR_ENABLE_Msk      0xFFUL
#define ETH_TX_PFC_PAUSE_VECTOR_Pos             8UL
#define ETH_TX_PFC_PAUSE_VECTOR_Msk             0xFF00UL
/* ETH.MASK_ADD1_BOTTOM */
#define ETH_MASK_ADD1_BOTTOM_ADDRESS_MASK_BOTTOM_Pos 0UL
#define ETH_MASK_ADD1_BOTTOM_ADDRESS_MASK_BOTTOM_Msk 0xFFFFFFFFUL
/* ETH.MASK_ADD1_TOP */
#define ETH_MASK_ADD1_TOP_ADDRESS_MASK_TOP_Pos  0UL
#define ETH_MASK_ADD1_TOP_ADDRESS_MASK_TOP_Msk  0xFFFFUL
/* ETH.DMA_ADDR_OR_MASK */
#define ETH_DMA_ADDR_OR_MASK_MASK_ENABLE_Pos    0UL
#define ETH_DMA_ADDR_OR_MASK_MASK_ENABLE_Msk    0xFUL
#define ETH_DMA_ADDR_OR_MASK_MASK_VALUE_DA_Pos  28UL
#define ETH_DMA_ADDR_OR_MASK_MASK_VALUE_DA_Msk  0xF0000000UL
/* ETH.RX_PTP_UNICAST */
#define ETH_RX_PTP_UNICAST_ADDRESS_UNICAST_Pos  0UL
#define ETH_RX_PTP_UNICAST_ADDRESS_UNICAST_Msk  0xFFFFFFFFUL
/* ETH.TX_PTP_UNICAST */
#define ETH_TX_PTP_UNICAST_ADDRESS_UNICAST_Pos  0UL
#define ETH_TX_PTP_UNICAST_ADDRESS_UNICAST_Msk  0xFFFFFFFFUL
/* ETH.TSU_NSEC_CMP */
#define ETH_TSU_NSEC_CMP_COMPARISON_NSEC_Pos    0UL
#define ETH_TSU_NSEC_CMP_COMPARISON_NSEC_Msk    0x3FFFFFUL
/* ETH.TSU_SEC_CMP */
#define ETH_TSU_SEC_CMP_COMPARISON_SEC_Pos      0UL
#define ETH_TSU_SEC_CMP_COMPARISON_SEC_Msk      0xFFFFFFFFUL
/* ETH.TSU_MSB_SEC_CMP */
#define ETH_TSU_MSB_SEC_CMP_COMPARISON_MSB_SEC_Pos 0UL
#define ETH_TSU_MSB_SEC_CMP_COMPARISON_MSB_SEC_Msk 0xFFFFUL
/* ETH.TSU_PTP_TX_MSB_SEC */
#define ETH_TSU_PTP_TX_MSB_SEC_TIMER_SECONDS_Pos 0UL
#define ETH_TSU_PTP_TX_MSB_SEC_TIMER_SECONDS_Msk 0xFFFFUL
/* ETH.TSU_PTP_RX_MSB_SEC */
#define ETH_TSU_PTP_RX_MSB_SEC_TIMER_SECONDS_Pos 0UL
#define ETH_TSU_PTP_RX_MSB_SEC_TIMER_SECONDS_Msk 0xFFFFUL
/* ETH.TSU_PEER_TX_MSB_SEC */
#define ETH_TSU_PEER_TX_MSB_SEC_TIMER_SECONDS_Pos 0UL
#define ETH_TSU_PEER_TX_MSB_SEC_TIMER_SECONDS_Msk 0xFFFFUL
/* ETH.TSU_PEER_RX_MSB_SEC */
#define ETH_TSU_PEER_RX_MSB_SEC_TIMER_SECONDS_Pos 0UL
#define ETH_TSU_PEER_RX_MSB_SEC_TIMER_SECONDS_Msk 0xFFFFUL
/* ETH.DPRAM_FILL_DBG */
#define ETH_DPRAM_FILL_DBG_DMA_TX_RX_FILL_LEVEL_SELECT_Pos 0UL
#define ETH_DPRAM_FILL_DBG_DMA_TX_RX_FILL_LEVEL_SELECT_Msk 0x1UL
#define ETH_DPRAM_FILL_DBG_DMA_TX_Q_FILL_LEVEL_SELECT_Pos 4UL
#define ETH_DPRAM_FILL_DBG_DMA_TX_Q_FILL_LEVEL_SELECT_Msk 0xF0UL
#define ETH_DPRAM_FILL_DBG_DMA_TX_RX_FILL_LEVEL_Pos 16UL
#define ETH_DPRAM_FILL_DBG_DMA_TX_RX_FILL_LEVEL_Msk 0xFFFF0000UL
/* ETH.REVISION_REG */
#define ETH_REVISION_REG_MODULE_REVISION_Pos    0UL
#define ETH_REVISION_REG_MODULE_REVISION_Msk    0xFFFFUL
#define ETH_REVISION_REG_MODULE_IDENTIFICATION_NUMBER_Pos 16UL
#define ETH_REVISION_REG_MODULE_IDENTIFICATION_NUMBER_Msk 0xFFF0000UL
#define ETH_REVISION_REG_FIX_NUMBER_Pos         28UL
#define ETH_REVISION_REG_FIX_NUMBER_Msk         0xF0000000UL
/* ETH.OCTETS_TXED_BOTTOM */
#define ETH_OCTETS_TXED_BOTTOM_COUNT_BOTTOM_Pos 0UL
#define ETH_OCTETS_TXED_BOTTOM_COUNT_BOTTOM_Msk 0xFFFFFFFFUL
/* ETH.OCTETS_TXED_TOP */
#define ETH_OCTETS_TXED_TOP_COUNT_TOP_Pos       0UL
#define ETH_OCTETS_TXED_TOP_COUNT_TOP_Msk       0xFFFFUL
/* ETH.FRAMES_TXED_OK */
#define ETH_FRAMES_TXED_OK_COUNT_OK_Pos         0UL
#define ETH_FRAMES_TXED_OK_COUNT_OK_Msk         0xFFFFFFFFUL
/* ETH.BROADCAST_TXED */
#define ETH_BROADCAST_TXED_COUNT_BROADCAST_Pos  0UL
#define ETH_BROADCAST_TXED_COUNT_BROADCAST_Msk  0xFFFFFFFFUL
/* ETH.MULTICAST_TXED */
#define ETH_MULTICAST_TXED_COUNT_MULTICAST_Pos  0UL
#define ETH_MULTICAST_TXED_COUNT_MULTICAST_Msk  0xFFFFFFFFUL
/* ETH.PAUSE_FRAMES_TXED */
#define ETH_PAUSE_FRAMES_TXED_COUNT_PAUSE_Pos   0UL
#define ETH_PAUSE_FRAMES_TXED_COUNT_PAUSE_Msk   0xFFFFUL
/* ETH.FRAMES_TXED_64 */
#define ETH_FRAMES_TXED_64_COUNT_64_Pos         0UL
#define ETH_FRAMES_TXED_64_COUNT_64_Msk         0xFFFFFFFFUL
/* ETH.FRAMES_TXED_65 */
#define ETH_FRAMES_TXED_65_COUNT_65_Pos         0UL
#define ETH_FRAMES_TXED_65_COUNT_65_Msk         0xFFFFFFFFUL
/* ETH.FRAMES_TXED_128 */
#define ETH_FRAMES_TXED_128_COUNT_128_Pos       0UL
#define ETH_FRAMES_TXED_128_COUNT_128_Msk       0xFFFFFFFFUL
/* ETH.FRAMES_TXED_256 */
#define ETH_FRAMES_TXED_256_COUNT_256_Pos       0UL
#define ETH_FRAMES_TXED_256_COUNT_256_Msk       0xFFFFFFFFUL
/* ETH.FRAMES_TXED_512 */
#define ETH_FRAMES_TXED_512_COUNT_512_Pos       0UL
#define ETH_FRAMES_TXED_512_COUNT_512_Msk       0xFFFFFFFFUL
/* ETH.FRAMES_TXED_1024 */
#define ETH_FRAMES_TXED_1024_COUNT_1024_Pos     0UL
#define ETH_FRAMES_TXED_1024_COUNT_1024_Msk     0xFFFFFFFFUL
/* ETH.FRAMES_TXED_1519 */
#define ETH_FRAMES_TXED_1519_COUNT_1519_Pos     0UL
#define ETH_FRAMES_TXED_1519_COUNT_1519_Msk     0xFFFFFFFFUL
/* ETH.TX_UNDERRUNS */
#define ETH_TX_UNDERRUNS_COUNT_UN_Pos           0UL
#define ETH_TX_UNDERRUNS_COUNT_UN_Msk           0x3FFUL
/* ETH.SINGLE_COLLISIONS */
#define ETH_SINGLE_COLLISIONS_COUNT14_Pos       0UL
#define ETH_SINGLE_COLLISIONS_COUNT14_Msk       0x3FFFFUL
/* ETH.MULTIPLE_COLLISIONS */
#define ETH_MULTIPLE_COLLISIONS_COUNT15_Pos     0UL
#define ETH_MULTIPLE_COLLISIONS_COUNT15_Msk     0x3FFFFUL
/* ETH.EXCESSIVE_COLLISIONS */
#define ETH_EXCESSIVE_COLLISIONS_COUNT16_Pos    0UL
#define ETH_EXCESSIVE_COLLISIONS_COUNT16_Msk    0x3FFUL
/* ETH.LATE_COLLISIONS */
#define ETH_LATE_COLLISIONS_COUNT17_Pos         0UL
#define ETH_LATE_COLLISIONS_COUNT17_Msk         0x3FFUL
/* ETH.DEFERRED_FRAMES */
#define ETH_DEFERRED_FRAMES_COUNT18_Pos         0UL
#define ETH_DEFERRED_FRAMES_COUNT18_Msk         0x3FFFFUL
/* ETH.CRS_ERRORS */
#define ETH_CRS_ERRORS_COUNT19_Pos              0UL
#define ETH_CRS_ERRORS_COUNT19_Msk              0x3FFUL
/* ETH.OCTETS_RXED_BOTTOM */
#define ETH_OCTETS_RXED_BOTTOM_COUNT_BOTTOM_Pos 0UL
#define ETH_OCTETS_RXED_BOTTOM_COUNT_BOTTOM_Msk 0xFFFFFFFFUL
/* ETH.OCTETS_RXED_TOP */
#define ETH_OCTETS_RXED_TOP_COUNT_TOP_Pos       0UL
#define ETH_OCTETS_RXED_TOP_COUNT_TOP_Msk       0xFFFFUL
/* ETH.FRAMES_RXED_OK */
#define ETH_FRAMES_RXED_OK_COUNT_OK_Pos         0UL
#define ETH_FRAMES_RXED_OK_COUNT_OK_Msk         0xFFFFFFFFUL
/* ETH.BROADCAST_RXED */
#define ETH_BROADCAST_RXED_COUNT_BROADCAST_Pos  0UL
#define ETH_BROADCAST_RXED_COUNT_BROADCAST_Msk  0xFFFFFFFFUL
/* ETH.MULTICAST_RXED */
#define ETH_MULTICAST_RXED_COUNT_MULTICAST_Pos  0UL
#define ETH_MULTICAST_RXED_COUNT_MULTICAST_Msk  0xFFFFFFFFUL
/* ETH.PAUSE_FRAMES_RXED */
#define ETH_PAUSE_FRAMES_RXED_COUNT_PAUSE_Pos   0UL
#define ETH_PAUSE_FRAMES_RXED_COUNT_PAUSE_Msk   0xFFFFUL
/* ETH.FRAMES_RXED_64 */
#define ETH_FRAMES_RXED_64_COUNT_64_Pos         0UL
#define ETH_FRAMES_RXED_64_COUNT_64_Msk         0xFFFFFFFFUL
/* ETH.FRAMES_RXED_65 */
#define ETH_FRAMES_RXED_65_COUNT_65_Pos         0UL
#define ETH_FRAMES_RXED_65_COUNT_65_Msk         0xFFFFFFFFUL
/* ETH.FRAMES_RXED_128 */
#define ETH_FRAMES_RXED_128_COUNT_128_Pos       0UL
#define ETH_FRAMES_RXED_128_COUNT_128_Msk       0xFFFFFFFFUL
/* ETH.FRAMES_RXED_256 */
#define ETH_FRAMES_RXED_256_COUNT_256_Pos       0UL
#define ETH_FRAMES_RXED_256_COUNT_256_Msk       0xFFFFFFFFUL
/* ETH.FRAMES_RXED_512 */
#define ETH_FRAMES_RXED_512_COUNT_512_Pos       0UL
#define ETH_FRAMES_RXED_512_COUNT_512_Msk       0xFFFFFFFFUL
/* ETH.FRAMES_RXED_1024 */
#define ETH_FRAMES_RXED_1024_COUNT_1024_Pos     0UL
#define ETH_FRAMES_RXED_1024_COUNT_1024_Msk     0xFFFFFFFFUL
/* ETH.FRAMES_RXED_1519 */
#define ETH_FRAMES_RXED_1519_COUNT_1519_Pos     0UL
#define ETH_FRAMES_RXED_1519_COUNT_1519_Msk     0xFFFFFFFFUL
/* ETH.UNDERSIZE_FRAMES */
#define ETH_UNDERSIZE_FRAMES_COUNT_UNDERSIZE_Pos 0UL
#define ETH_UNDERSIZE_FRAMES_COUNT_UNDERSIZE_Msk 0x3FFUL
/* ETH.EXCESSIVE_RX_LENGTH */
#define ETH_EXCESSIVE_RX_LENGTH_COUNT_OVERSIZE_Pos 0UL
#define ETH_EXCESSIVE_RX_LENGTH_COUNT_OVERSIZE_Msk 0x3FFUL
/* ETH.RX_JABBERS */
#define ETH_RX_JABBERS_COUNT_JABBERS_Pos        0UL
#define ETH_RX_JABBERS_COUNT_JABBERS_Msk        0x3FFUL
/* ETH.FCS_ERRORS */
#define ETH_FCS_ERRORS_COUNT_FCS_ERR_Pos        0UL
#define ETH_FCS_ERRORS_COUNT_FCS_ERR_Msk        0x3FFUL
/* ETH.RX_LENGTH_ERRORS */
#define ETH_RX_LENGTH_ERRORS_COUNT_LENGTH_ERR_Pos 0UL
#define ETH_RX_LENGTH_ERRORS_COUNT_LENGTH_ERR_Msk 0x3FFUL
/* ETH.RX_SYMBOL_ERRORS */
#define ETH_RX_SYMBOL_ERRORS_COUNT_SYMBOL_ERR_Pos 0UL
#define ETH_RX_SYMBOL_ERRORS_COUNT_SYMBOL_ERR_Msk 0x3FFUL
/* ETH.ALIGNMENT_ERRORS */
#define ETH_ALIGNMENT_ERRORS_COUNT_ALIGNMENT_ERROR_Pos 0UL
#define ETH_ALIGNMENT_ERRORS_COUNT_ALIGNMENT_ERROR_Msk 0x3FFUL
/* ETH.RX_RESOURCE_ERRORS */
#define ETH_RX_RESOURCE_ERRORS_COUNT_RESOURCE_ERR_Pos 0UL
#define ETH_RX_RESOURCE_ERRORS_COUNT_RESOURCE_ERR_Msk 0x3FFFFUL
/* ETH.RX_OVERRUNS */
#define ETH_RX_OVERRUNS_COUNT_OVERRUN_Pos       0UL
#define ETH_RX_OVERRUNS_COUNT_OVERRUN_Msk       0x3FFUL
/* ETH.RX_IP_CK_ERRORS */
#define ETH_RX_IP_CK_ERRORS_COUNT_IPCK_ERR_Pos  0UL
#define ETH_RX_IP_CK_ERRORS_COUNT_IPCK_ERR_Msk  0xFFUL
/* ETH.RX_TCP_CK_ERRORS */
#define ETH_RX_TCP_CK_ERRORS_COUNT_TCPCK_ERR_Pos 0UL
#define ETH_RX_TCP_CK_ERRORS_COUNT_TCPCK_ERR_Msk 0xFFUL
/* ETH.RX_UDP_CK_ERRORS */
#define ETH_RX_UDP_CK_ERRORS_COUNT_UDPCK_ERR_Pos 0UL
#define ETH_RX_UDP_CK_ERRORS_COUNT_UDPCK_ERR_Msk 0xFFUL
/* ETH.AUTO_FLUSHED_PKTS */
#define ETH_AUTO_FLUSHED_PKTS_COUNT_FLUSHED_Pos 0UL
#define ETH_AUTO_FLUSHED_PKTS_COUNT_FLUSHED_Msk 0xFFFFUL
/* ETH.TSU_TIMER_INCR_SUB_NSEC */
#define ETH_TSU_TIMER_INCR_SUB_NSEC_SUB_NS_INCR_Pos 0UL
#define ETH_TSU_TIMER_INCR_SUB_NSEC_SUB_NS_INCR_Msk 0xFFFFUL
#define ETH_TSU_TIMER_INCR_SUB_NSEC_SUB_NS_INCR_LSB_Pos 24UL
#define ETH_TSU_TIMER_INCR_SUB_NSEC_SUB_NS_INCR_LSB_Msk 0xFF000000UL
/* ETH.TSU_TIMER_MSB_SEC */
#define ETH_TSU_TIMER_MSB_SEC_TIMER_MSB_SEC_Pos 0UL
#define ETH_TSU_TIMER_MSB_SEC_TIMER_MSB_SEC_Msk 0xFFFFUL
/* ETH.TSU_STROBE_MSB_SEC */
#define ETH_TSU_STROBE_MSB_SEC_STROBE_MSB_SEC_Pos 0UL
#define ETH_TSU_STROBE_MSB_SEC_STROBE_MSB_SEC_Msk 0xFFFFUL
/* ETH.TSU_STROBE_SEC */
#define ETH_TSU_STROBE_SEC_STROBE_SEC_Pos       0UL
#define ETH_TSU_STROBE_SEC_STROBE_SEC_Msk       0xFFFFFFFFUL
/* ETH.TSU_STROBE_NSEC */
#define ETH_TSU_STROBE_NSEC_STROBE_NSEC_Pos     0UL
#define ETH_TSU_STROBE_NSEC_STROBE_NSEC_Msk     0x3FFFFFFFUL
/* ETH.TSU_TIMER_SEC */
#define ETH_TSU_TIMER_SEC_TIMER_SEC_Pos         0UL
#define ETH_TSU_TIMER_SEC_TIMER_SEC_Msk         0xFFFFFFFFUL
/* ETH.TSU_TIMER_NSEC */
#define ETH_TSU_TIMER_NSEC_TIMER_NSEC_Pos       0UL
#define ETH_TSU_TIMER_NSEC_TIMER_NSEC_Msk       0x3FFFFFFFUL
/* ETH.TSU_TIMER_ADJUST */
#define ETH_TSU_TIMER_ADJUST_INCREMENT_VALUE_Pos 0UL
#define ETH_TSU_TIMER_ADJUST_INCREMENT_VALUE_Msk 0x3FFFFFFFUL
#define ETH_TSU_TIMER_ADJUST_ADD_SUBTRACT_Pos   31UL
#define ETH_TSU_TIMER_ADJUST_ADD_SUBTRACT_Msk   0x80000000UL
/* ETH.TSU_TIMER_INCR */
#define ETH_TSU_TIMER_INCR_NS_INCREMENT_Pos     0UL
#define ETH_TSU_TIMER_INCR_NS_INCREMENT_Msk     0xFFUL
#define ETH_TSU_TIMER_INCR_ALT_NS_INCR_Pos      8UL
#define ETH_TSU_TIMER_INCR_ALT_NS_INCR_Msk      0xFF00UL
#define ETH_TSU_TIMER_INCR_NUM_INCS_Pos         16UL
#define ETH_TSU_TIMER_INCR_NUM_INCS_Msk         0xFF0000UL
/* ETH.TSU_PTP_TX_SEC */
#define ETH_TSU_PTP_TX_SEC_TIMER_PTP_SEC_Pos    0UL
#define ETH_TSU_PTP_TX_SEC_TIMER_PTP_SEC_Msk    0xFFFFFFFFUL
/* ETH.TSU_PTP_TX_NSEC */
#define ETH_TSU_PTP_TX_NSEC_TIMER_PTP_NSEC_Pos  0UL
#define ETH_TSU_PTP_TX_NSEC_TIMER_PTP_NSEC_Msk  0x3FFFFFFFUL
/* ETH.TSU_PTP_RX_SEC */
#define ETH_TSU_PTP_RX_SEC_TIMER_PTP_SEC_Pos    0UL
#define ETH_TSU_PTP_RX_SEC_TIMER_PTP_SEC_Msk    0xFFFFFFFFUL
/* ETH.TSU_PTP_RX_NSEC */
#define ETH_TSU_PTP_RX_NSEC_TIMER_PTP_NSEC_Pos  0UL
#define ETH_TSU_PTP_RX_NSEC_TIMER_PTP_NSEC_Msk  0x3FFFFFFFUL
/* ETH.TSU_PEER_TX_SEC */
#define ETH_TSU_PEER_TX_SEC_TIMER_PEER_SEC_Pos  0UL
#define ETH_TSU_PEER_TX_SEC_TIMER_PEER_SEC_Msk  0xFFFFFFFFUL
/* ETH.TSU_PEER_TX_NSEC */
#define ETH_TSU_PEER_TX_NSEC_TIMER_PEER_NSEC_Pos 0UL
#define ETH_TSU_PEER_TX_NSEC_TIMER_PEER_NSEC_Msk 0x3FFFFFFFUL
/* ETH.TSU_PEER_RX_SEC */
#define ETH_TSU_PEER_RX_SEC_TIMER_PEER_SEC_Pos  0UL
#define ETH_TSU_PEER_RX_SEC_TIMER_PEER_SEC_Msk  0xFFFFFFFFUL
/* ETH.TSU_PEER_RX_NSEC */
#define ETH_TSU_PEER_RX_NSEC_TIMER_PEER_NSEC_Pos 0UL
#define ETH_TSU_PEER_RX_NSEC_TIMER_PEER_NSEC_Msk 0x3FFFFFFFUL
/* ETH.PCS_CONTROL */
#define ETH_PCS_CONTROL_REMOVED_31_0_Pos        0UL
#define ETH_PCS_CONTROL_REMOVED_31_0_Msk        0xFFFFFFFFUL
/* ETH.PCS_STATUS */
#define ETH_PCS_STATUS_REMOVED_31_0_Pos         0UL
#define ETH_PCS_STATUS_REMOVED_31_0_Msk         0xFFFFFFFFUL
/* ETH.PCS_AN_ADV */
#define ETH_PCS_AN_ADV_REMOVED_31_0_Pos         0UL
#define ETH_PCS_AN_ADV_REMOVED_31_0_Msk         0xFFFFFFFFUL
/* ETH.PCS_AN_LP_BASE */
#define ETH_PCS_AN_LP_BASE_REMOVED_31_0_Pos     0UL
