PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_eth_v3.h
#define ETH_SCREENING_TYPE_1_REGISTER_6_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_6_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_6_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_6_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_6_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_6_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_7 */
#define ETH_SCREENING_TYPE_1_REGISTER_7_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_7_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_7_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_7_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_7_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_7_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_7_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_7_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_7_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_7_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_8 */
#define ETH_SCREENING_TYPE_1_REGISTER_8_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_8_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_8_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_8_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_8_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_8_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_8_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_8_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_8_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_8_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_9 */
#define ETH_SCREENING_TYPE_1_REGISTER_9_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_9_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_9_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_9_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_9_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_9_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_9_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_9_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_9_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_9_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_10 */
#define ETH_SCREENING_TYPE_1_REGISTER_10_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_10_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_10_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_10_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_10_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_10_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_10_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_10_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_10_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_10_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_11 */
#define ETH_SCREENING_TYPE_1_REGISTER_11_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_11_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_11_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_11_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_11_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_11_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_11_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_11_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_11_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_11_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_12 */
#define ETH_SCREENING_TYPE_1_REGISTER_12_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_12_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_12_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_12_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_12_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_12_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_12_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_12_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_12_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_12_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_13 */
#define ETH_SCREENING_TYPE_1_REGISTER_13_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_13_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_13_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_13_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_13_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_13_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_13_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_13_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_13_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_13_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_14 */
#define ETH_SCREENING_TYPE_1_REGISTER_14_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_14_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_14_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_14_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_14_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_14_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_14_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_14_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_14_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_14_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_1_REGISTER_15 */
#define ETH_SCREENING_TYPE_1_REGISTER_15_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_1_REGISTER_15_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_1_REGISTER_15_DSTC_MATCH_Pos 4UL
#define ETH_SCREENING_TYPE_1_REGISTER_15_DSTC_MATCH_Msk 0xFF0UL
#define ETH_SCREENING_TYPE_1_REGISTER_15_UDP_PORT_MATCH_Pos 12UL
#define ETH_SCREENING_TYPE_1_REGISTER_15_UDP_PORT_MATCH_Msk 0xFFFF000UL
#define ETH_SCREENING_TYPE_1_REGISTER_15_DSTC_ENABLE_Pos 28UL
#define ETH_SCREENING_TYPE_1_REGISTER_15_DSTC_ENABLE_Msk 0x10000000UL
#define ETH_SCREENING_TYPE_1_REGISTER_15_UDP_PORT_MATCH_ENABLE_Pos 29UL
#define ETH_SCREENING_TYPE_1_REGISTER_15_UDP_PORT_MATCH_ENABLE_Msk 0x20000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_0 */
#define ETH_SCREENING_TYPE_2_REGISTER_0_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_0_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_0_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_1 */
#define ETH_SCREENING_TYPE_2_REGISTER_1_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_1_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_1_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_2 */
#define ETH_SCREENING_TYPE_2_REGISTER_2_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_2_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_2_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_3 */
#define ETH_SCREENING_TYPE_2_REGISTER_3_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_3_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_3_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_4 */
#define ETH_SCREENING_TYPE_2_REGISTER_4_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_4_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_4_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_5 */
#define ETH_SCREENING_TYPE_2_REGISTER_5_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_5_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_5_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_6 */
#define ETH_SCREENING_TYPE_2_REGISTER_6_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_6_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_6_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_7 */
#define ETH_SCREENING_TYPE_2_REGISTER_7_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_7_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_7_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_8 */
#define ETH_SCREENING_TYPE_2_REGISTER_8_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_8_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_8_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_9 */
#define ETH_SCREENING_TYPE_2_REGISTER_9_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_QUEUE_NUMBER_Msk 0xFUL
#define ETH_SCREENING_TYPE_2_REGISTER_9_VLAN_PRIORITY_Pos 4UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_VLAN_PRIORITY_Msk 0x70UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_RESERVED_7_Pos 7UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_RESERVED_7_Msk 0x80UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_VLAN_ENABLE_Pos 8UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_VLAN_ENABLE_Msk 0x100UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_INDEX_Pos 9UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_INDEX_Msk 0xE00UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_ETHERTYPE_ENABLE_Pos 12UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_ETHERTYPE_ENABLE_Msk 0x1000UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_A_Pos 13UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_A_Msk 0x3E000UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_A_ENABLE_Pos 18UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_A_ENABLE_Msk 0x40000UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_B_Pos 19UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_B_Msk 0xF80000UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_B_ENABLE_Pos 24UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_B_ENABLE_Msk 0x1000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_C_Pos 25UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_C_Msk 0x3E000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_C_ENABLE_Pos 30UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_COMPARE_C_ENABLE_Msk 0x40000000UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_RESERVED_31_Pos 31UL
#define ETH_SCREENING_TYPE_2_REGISTER_9_RESERVED_31_Msk 0x80000000UL
/* ETH.SCREENING_TYPE_2_REGISTER_10 */
#define ETH_SCREENING_TYPE_2_REGISTER_10_QUEUE_NUMBER_Pos 0UL
#define ETH_SCREENING_TYPE_2_REGISTER_10_QUEUE_NUMBER_Msk 0xFUL
