PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_eth_v3.h
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_7_RESERVED_31_16_Pos 16UL
#define ETH_SCREENING_TYPE_2_ETHERTYPE_REG_7_RESERVED_31_16_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_0_WORD_0 */
#define ETH_TYPE2_COMPARE_0_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_0_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_0_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_0_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_0_WORD_1 */
#define ETH_TYPE2_COMPARE_0_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_0_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_0_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_0_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_0_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_0_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_0_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_0_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_1_WORD_0 */
#define ETH_TYPE2_COMPARE_1_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_1_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_1_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_1_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_1_WORD_1 */
#define ETH_TYPE2_COMPARE_1_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_1_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_1_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_1_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_1_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_1_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_1_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_1_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_2_WORD_0 */
#define ETH_TYPE2_COMPARE_2_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_2_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_2_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_2_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_2_WORD_1 */
#define ETH_TYPE2_COMPARE_2_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_2_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_2_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_2_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_2_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_2_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_2_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_2_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_3_WORD_0 */
#define ETH_TYPE2_COMPARE_3_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_3_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_3_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_3_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_3_WORD_1 */
#define ETH_TYPE2_COMPARE_3_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_3_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_3_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_3_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_3_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_3_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_3_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_3_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_4_WORD_0 */
#define ETH_TYPE2_COMPARE_4_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_4_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_4_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_4_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_4_WORD_1 */
#define ETH_TYPE2_COMPARE_4_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_4_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_4_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_4_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_4_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_4_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_4_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_4_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_5_WORD_0 */
#define ETH_TYPE2_COMPARE_5_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_5_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_5_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_5_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_5_WORD_1 */
#define ETH_TYPE2_COMPARE_5_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_5_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_5_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_5_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_5_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_5_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_5_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_5_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_6_WORD_0 */
#define ETH_TYPE2_COMPARE_6_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_6_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_6_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_6_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_6_WORD_1 */
#define ETH_TYPE2_COMPARE_6_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_6_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_6_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_6_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_6_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_6_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_6_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_6_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_7_WORD_0 */
#define ETH_TYPE2_COMPARE_7_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_7_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_7_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_7_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_7_WORD_1 */
#define ETH_TYPE2_COMPARE_7_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_7_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_7_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_7_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_7_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_7_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_7_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_7_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_8_WORD_0 */
#define ETH_TYPE2_COMPARE_8_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_8_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_8_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_8_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_8_WORD_1 */
#define ETH_TYPE2_COMPARE_8_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_8_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_8_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_8_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_8_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_8_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_8_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_8_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_9_WORD_0 */
#define ETH_TYPE2_COMPARE_9_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_9_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_9_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_9_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_9_WORD_1 */
#define ETH_TYPE2_COMPARE_9_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_9_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_9_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_9_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_9_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_9_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_9_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_9_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_10_WORD_0 */
#define ETH_TYPE2_COMPARE_10_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_10_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_10_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_10_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_10_WORD_1 */
#define ETH_TYPE2_COMPARE_10_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_10_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_10_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_10_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_10_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_10_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_10_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_10_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_11_WORD_0 */
#define ETH_TYPE2_COMPARE_11_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_11_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_11_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_11_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_11_WORD_1 */
#define ETH_TYPE2_COMPARE_11_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_11_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_11_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_11_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_11_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_11_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_11_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_11_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_12_WORD_0 */
#define ETH_TYPE2_COMPARE_12_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_12_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_12_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_12_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_12_WORD_1 */
#define ETH_TYPE2_COMPARE_12_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_12_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_12_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_12_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_12_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_12_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_12_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_12_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_13_WORD_0 */
#define ETH_TYPE2_COMPARE_13_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_13_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_13_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_13_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_13_WORD_1 */
#define ETH_TYPE2_COMPARE_13_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_13_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_13_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_13_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_13_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_13_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_13_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_13_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_14_WORD_0 */
#define ETH_TYPE2_COMPARE_14_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_14_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_14_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_14_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_14_WORD_1 */
#define ETH_TYPE2_COMPARE_14_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_14_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_14_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_14_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_14_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_14_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_14_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_14_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_15_WORD_0 */
#define ETH_TYPE2_COMPARE_15_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_15_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_15_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_15_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_15_WORD_1 */
#define ETH_TYPE2_COMPARE_15_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_15_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_15_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_15_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_15_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_15_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_15_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_15_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_16_WORD_0 */
#define ETH_TYPE2_COMPARE_16_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_16_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_16_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_16_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_16_WORD_1 */
#define ETH_TYPE2_COMPARE_16_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_16_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_16_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_16_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_16_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_16_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_16_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_16_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_17_WORD_0 */
#define ETH_TYPE2_COMPARE_17_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_17_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_17_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_17_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_17_WORD_1 */
#define ETH_TYPE2_COMPARE_17_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_17_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_17_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_17_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_17_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_17_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_17_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_17_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_18_WORD_0 */
#define ETH_TYPE2_COMPARE_18_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_18_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_18_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_18_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_18_WORD_1 */
#define ETH_TYPE2_COMPARE_18_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_18_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_18_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_18_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_18_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_18_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_18_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_18_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_19_WORD_0 */
#define ETH_TYPE2_COMPARE_19_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_19_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_19_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_19_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_19_WORD_1 */
#define ETH_TYPE2_COMPARE_19_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_19_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_19_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_19_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_19_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_19_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_19_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_19_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_20_WORD_0 */
#define ETH_TYPE2_COMPARE_20_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_20_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_20_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_20_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_20_WORD_1 */
#define ETH_TYPE2_COMPARE_20_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_20_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_20_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_20_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_20_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_20_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_20_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_20_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_21_WORD_0 */
#define ETH_TYPE2_COMPARE_21_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_21_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_21_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_21_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_21_WORD_1 */
#define ETH_TYPE2_COMPARE_21_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_21_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_21_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_21_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_21_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_21_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_21_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_21_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_22_WORD_0 */
#define ETH_TYPE2_COMPARE_22_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_22_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_22_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_22_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_22_WORD_1 */
#define ETH_TYPE2_COMPARE_22_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_22_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_22_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_22_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_22_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_22_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_22_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_22_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_23_WORD_0 */
#define ETH_TYPE2_COMPARE_23_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_23_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_23_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_23_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_23_WORD_1 */
#define ETH_TYPE2_COMPARE_23_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_23_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_23_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_23_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_23_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_23_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_23_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_23_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_24_WORD_0 */
#define ETH_TYPE2_COMPARE_24_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_24_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_24_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_24_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_24_WORD_1 */
#define ETH_TYPE2_COMPARE_24_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_24_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_24_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_24_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_24_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_24_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_24_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_24_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_25_WORD_0 */
#define ETH_TYPE2_COMPARE_25_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_25_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_25_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_25_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_25_WORD_1 */
#define ETH_TYPE2_COMPARE_25_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_25_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_25_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_25_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_25_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_25_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_25_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_25_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_26_WORD_0 */
#define ETH_TYPE2_COMPARE_26_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_26_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_26_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_26_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_26_WORD_1 */
#define ETH_TYPE2_COMPARE_26_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_26_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_26_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_26_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_26_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_26_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_26_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_26_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_27_WORD_0 */
#define ETH_TYPE2_COMPARE_27_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_27_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_27_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_27_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_27_WORD_1 */
#define ETH_TYPE2_COMPARE_27_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_27_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_27_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_27_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_27_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_27_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_27_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_27_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_28_WORD_0 */
#define ETH_TYPE2_COMPARE_28_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_28_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_28_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_28_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_28_WORD_1 */
#define ETH_TYPE2_COMPARE_28_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_28_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_28_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_28_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_28_WORD_1_DISABLE_MASK_Pos 9UL
#define ETH_TYPE2_COMPARE_28_WORD_1_DISABLE_MASK_Msk 0x200UL
#define ETH_TYPE2_COMPARE_28_WORD_1_RESERVED_31_10_Pos 10UL
#define ETH_TYPE2_COMPARE_28_WORD_1_RESERVED_31_10_Msk 0xFFFFFC00UL
/* ETH.TYPE2_COMPARE_29_WORD_0 */
#define ETH_TYPE2_COMPARE_29_WORD_0_MASK_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_29_WORD_0_MASK_VALUE_Msk 0xFFFFUL
#define ETH_TYPE2_COMPARE_29_WORD_0_COMPARE_VALUE_TYPE2_Pos 16UL
#define ETH_TYPE2_COMPARE_29_WORD_0_COMPARE_VALUE_TYPE2_Msk 0xFFFF0000UL
/* ETH.TYPE2_COMPARE_29_WORD_1 */
#define ETH_TYPE2_COMPARE_29_WORD_1_OFFSET_VALUE_Pos 0UL
#define ETH_TYPE2_COMPARE_29_WORD_1_OFFSET_VALUE_Msk 0x7FUL
#define ETH_TYPE2_COMPARE_29_WORD_1_COMPARE_OFFSET_Pos 7UL
#define ETH_TYPE2_COMPARE_29_WORD_1_COMPARE_OFFSET_Msk 0x180UL
#define ETH_TYPE2_COMPARE_29_WORD_1_DISABLE_MASK_Pos 9UL
